ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415rx.h
/*!< USBDIV configuration */
#define CRM_CFG_USBDIV_Msk                  ((0x3U << 22) | (0x1U << 27))           /*!< 0x08C00000 */
#define CRM_CFG_USBDIV                      CRM_CFG_USBDIV_Msk                      /*!< USBDIV[2:0] bits (USB division factor) */
#define CRM_CFG_USBDIV_0                    (0x1U << 22)                            /*!< 0x00400000 */
#define CRM_CFG_USBDIV_1                    (0x2U << 22)                            /*!< 0x00800000 */
#define CRM_CFG_USBDIV_2                    (0x1U << 27)                            /*!< 0x08000000 */

#define CRM_CFG_USBDIV_DIV1_5               0x00000000U                             /*!< PLL/1.5 */
#define CRM_CFG_USBDIV_DIV1                 0x00400000U                             /*!< PLL/1 */
#define CRM_CFG_USBDIV_DIV2_5               0x00800000U                             /*!< PLL/2.5 */
#define CRM_CFG_USBDIV_DIV2                 0x00C00000U                             /*!< PLL/2 */
#define CRM_CFG_USBDIV_DIV3_5               0x08000000U                             /*!< PLL/3.5 */
#define CRM_CFG_USBDIV_DIV3                 0x08400000U                             /*!< PLL/3 */
#define CRM_CFG_USBDIV_DIV4                 0x08800000U                             /*!< PLL/4 */

/*!< CLKOUT_SEL configuration */
#define CRM_CFG_CLKOUT_SEL_Msk              ((CRM_MISC1_CLKOUT_SEL) | (0x7U << 24)) /*!< 0x07010000 */
#define CRM_CFG_CLKOUT_SEL                  CRM_CFG_CLKOUT_SEL_Msk                  /*!< CLKOUT_SEL[3:0] bits (Clock output selection) */
#define CRM_CFG_CLKOUT_SEL_0                (0x1U << 24)                            /*!< 0x01000000 */
#define CRM_CFG_CLKOUT_SEL_1                (0x2U << 24)                            /*!< 0x02000000 */
#define CRM_CFG_CLKOUT_SEL_2                (0x4U << 24)                            /*!< 0x04000000 */
#define CRM_CFG_CLKOUT_SEL_3                CRM_MISC1_CLKOUT_SEL                    /*!< 0x00010000 */

#define CRM_CFG_CLKOUT_SEL_NOCLOCK          0x00000000U                             /*!< Not clock output */
#define CRM_CFG_CLKOUT_SEL_LICK             0x02000000U                             /*!< LICK */
#define CRM_CFG_CLKOUT_SEL_LEXT             0x03000000U                             /*!< LEXT */
#define CRM_CFG_CLKOUT_SEL_SCLK             0x04000000U                             /*!< SCLK */
#define CRM_CFG_CLKOUT_SEL_HICK             0x05000000U                             /*!< HICK */
#define CRM_CFG_CLKOUT_SEL_HEXT             0x06000000U                             /*!< HEXT */
#define CRM_CFG_CLKOUT_SEL_PLL_DIV2         0x07000000U                             /*!< PLL/2 */
#define CRM_MISC1_CLKOUT_SEL_PLL_DIV4       0x04010000U                             /*!< PLL/4 */
#define CRM_MISC1_CLKOUT_SEL_USB            0x05010000U                             /*!< USB */
#define CRM_MISC1_CLKOUT_SEL_ADC            0x06010000U                             /*!< ADC */

/* Reference defines */
#define CRM_CFG_CLKSEL                      CRM_CFG_CLKOUT_SEL
#define CRM_CFG_CLKSEL_0                    CRM_CFG_CLKOUT_SEL_0
#define CRM_CFG_CLKSEL_1                    CRM_CFG_CLKOUT_SEL_1
#define CRM_CFG_CLKSEL_2                    CRM_CFG_CLKOUT_SEL_2
#define CRM_CFG_CLKSEL_NOCLOCK              CRM_CFG_CLKOUT_SEL_NOCLOCK
#define CRM_CFG_CLKSEL_LICK                 CRM_CFG_CLKOUT_SEL_LICK
#define CRM_CFG_CLKSEL_LEXT                 CRM_CFG_CLKOUT_SEL_LEXT
#define CRM_CFG_CLKSEL_SCLK                 CRM_CFG_CLKOUT_SEL_SCLK
#define CRM_CFG_CLKSEL_HICK                 CRM_CFG_CLKOUT_SEL_HICK
#define CRM_CFG_CLKSEL_HEXT                 CRM_CFG_CLKOUT_SEL_HEXT
#define CRM_CFG_CLKSEL_PLL_DIV2             CRM_CFG_CLKOUT_SEL_PLL_DIV2
#define CRM_MISC1_CLKSEL_PLL_DIV4           CRM_MISC1_CLKOUT_SEL_PLL_DIV4
#define CRM_MISC1_CLKSEL_USB                CRM_MISC1_CLKOUT_SEL_USB
#define CRM_MISC1_CLKSEL_ADC                CRM_MISC1_CLKOUT_SEL_ADC

/******************  Bit definition for CRM_CLKINT register  ******************/
#define CRM_CLKINT_LICKSTBLF_Pos            (0U)
#define CRM_CLKINT_LICKSTBLF_Msk            (0x1U << CRM_CLKINT_LICKSTBLF_Pos)      /*!< 0x00000001 */
#define CRM_CLKINT_LICKSTBLF                CRM_CLKINT_LICKSTBLF_Msk                /*!< LICK stable interrupt flag */
#define CRM_CLKINT_LEXTSTBLF_Pos            (1U)
#define CRM_CLKINT_LEXTSTBLF_Msk            (0x1U << CRM_CLKINT_LEXTSTBLF_Pos)      /*!< 0x00000002 */
#define CRM_CLKINT_LEXTSTBLF                CRM_CLKINT_LEXTSTBLF_Msk                /*!< LEXT stable flag */
#define CRM_CLKINT_HICKSTBLF_Pos            (2U)
#define CRM_CLKINT_HICKSTBLF_Msk            (0x1U << CRM_CLKINT_HICKSTBLF_Pos)      /*!< 0x00000004 */
#define CRM_CLKINT_HICKSTBLF                CRM_CLKINT_HICKSTBLF_Msk                /*!< HICK stable flag */
#define CRM_CLKINT_HEXTSTBLF_Pos            (3U)
#define CRM_CLKINT_HEXTSTBLF_Msk            (0x1U << CRM_CLKINT_HEXTSTBLF_Pos)      /*!< 0x00000008 */
#define CRM_CLKINT_HEXTSTBLF                CRM_CLKINT_HEXTSTBLF_Msk                /*!< HEXT stable flag */
#define CRM_CLKINT_PLLSTBLF_Pos             (4U)
#define CRM_CLKINT_PLLSTBLF_Msk             (0x1U << CRM_CLKINT_PLLSTBLF_Pos)       /*!< 0x00000010 */
#define CRM_CLKINT_PLLSTBLF                 CRM_CLKINT_PLLSTBLF_Msk                 /*!< PLL stable flag */
#define CRM_CLKINT_CFDF_Pos                 (7U)
#define CRM_CLKINT_CFDF_Msk                 (0x1U << CRM_CLKINT_CFDF_Pos)           /*!< 0x00000080 */
#define CRM_CLKINT_CFDF                     CRM_CLKINT_CFDF_Msk                     /*!< Clock failure detection flag */
#define CRM_CLKINT_LICKSTBLIEN_Pos          (8U)
#define CRM_CLKINT_LICKSTBLIEN_Msk          (0x1U << CRM_CLKINT_LICKSTBLIEN_Pos)    /*!< 0x00000100 */
#define CRM_CLKINT_LICKSTBLIEN              CRM_CLKINT_LICKSTBLIEN_Msk              /*!< LICK stable interrupt enable */
#define CRM_CLKINT_LEXTSTBLIEN_Pos          (9U)
#define CRM_CLKINT_LEXTSTBLIEN_Msk          (0x1U << CRM_CLKINT_LEXTSTBLIEN_Pos)    /*!< 0x00000200 */
#define CRM_CLKINT_LEXTSTBLIEN              CRM_CLKINT_LEXTSTBLIEN_Msk              /*!< LEXT stable interrupt enable */
#define CRM_CLKINT_HICKSTBLIEN_Pos          (10U)
#define CRM_CLKINT_HICKSTBLIEN_Msk          (0x1U << CRM_CLKINT_HICKSTBLIEN_Pos)    /*!< 0x00000400 */
#define CRM_CLKINT_HICKSTBLIEN              CRM_CLKINT_HICKSTBLIEN_Msk              /*!< HICK stable interrupt enable */
#define CRM_CLKINT_HEXTSTBLIEN_Pos          (11U)
#define CRM_CLKINT_HEXTSTBLIEN_Msk          (0x1U << CRM_CLKINT_HEXTSTBLIEN_Pos)    /*!< 0x00000800 */
#define CRM_CLKINT_HEXTSTBLIEN              CRM_CLKINT_HEXTSTBLIEN_Msk              /*!< HEXT stable interrupt enable */
#define CRM_CLKINT_PLLSTBLIEN_Pos           (12U)
#define CRM_CLKINT_PLLSTBLIEN_Msk           (0x1U << CRM_CLKINT_PLLSTBLIEN_Pos)     /*!< 0x00001000 */
#define CRM_CLKINT_PLLSTBLIEN               CRM_CLKINT_PLLSTBLIEN_Msk               /*!< PLL stable interrupt enable */
#define CRM_CLKINT_LICKSTBLFC_Pos           (16U)
#define CRM_CLKINT_LICKSTBLFC_Msk           (0x1U << CRM_CLKINT_LICKSTBLFC_Pos)     /*!< 0x00010000 */
#define CRM_CLKINT_LICKSTBLFC               CRM_CLKINT_LICKSTBLFC_Msk               /*!< LICK stable flag clear */
#define CRM_CLKINT_LEXTSTBLFC_Pos           (17U)
#define CRM_CLKINT_LEXTSTBLFC_Msk           (0x1U << CRM_CLKINT_LEXTSTBLFC_Pos)     /*!< 0x00020000 */
#define CRM_CLKINT_LEXTSTBLFC               CRM_CLKINT_LEXTSTBLFC_Msk               /*!< LEXT stable flag clear */
#define CRM_CLKINT_HICKSTBLFC_Pos           (18U)
#define CRM_CLKINT_HICKSTBLFC_Msk           (0x1U << CRM_CLKINT_HICKSTBLFC_Pos)     /*!< 0x00040000 */
#define CRM_CLKINT_HICKSTBLFC               CRM_CLKINT_HICKSTBLFC_Msk               /*!< HICK stable flag clear */
#define CRM_CLKINT_HEXTSTBLFC_Pos           (19U)
#define CRM_CLKINT_HEXTSTBLFC_Msk           (0x1U << CRM_CLKINT_HEXTSTBLFC_Pos)     /*!< 0x00080000 */
#define CRM_CLKINT_HEXTSTBLFC               CRM_CLKINT_HEXTSTBLFC_Msk               /*!< HEXT stable flag clear */
#define CRM_CLKINT_PLLSTBLFC_Pos            (20U)
#define CRM_CLKINT_PLLSTBLFC_Msk            (0x1U << CRM_CLKINT_PLLSTBLFC_Pos)      /*!< 0x00100000 */
#define CRM_CLKINT_PLLSTBLFC                CRM_CLKINT_PLLSTBLFC_Msk                /*!< PLL stable flag clear */
#define CRM_CLKINT_CFDFC_Pos                (23U)
#define CRM_CLKINT_CFDFC_Msk                (0x1U << CRM_CLKINT_CFDFC_Pos)          /*!< 0x00800000 */
#define CRM_CLKINT_CFDFC                    CRM_CLKINT_CFDFC_Msk                    /*!< Clock failure detection flag clear */

/*****************  Bit definition for CRM_APB2RST register  ******************/
#define CRM_APB2RST_IOMUXRST_Pos            (0U)
#define CRM_APB2RST_IOMUXRST_Msk            (0x1U << CRM_APB2RST_IOMUXRST_Pos)      /*!< 0x00000001 */
#define CRM_APB2RST_IOMUXRST                CRM_APB2RST_IOMUXRST_Msk                /*!< IOMUX reset */
#define CRM_APB2RST_EXINTRST_Pos            (1U)
#define CRM_APB2RST_EXINTRST_Msk            (0x1U << CRM_APB2RST_EXINTRST_Pos)      /*!< 0x00000002 */
#define CRM_APB2RST_EXINTRST                CRM_APB2RST_EXINTRST_Msk                /*!< EXINT reset */
#define CRM_APB2RST_GPIOARST_Pos            (2U)
#define CRM_APB2RST_GPIOARST_Msk            (0x1U << CRM_APB2RST_GPIOARST_Pos)      /*!< 0x00000004 */
#define CRM_APB2RST_GPIOARST                CRM_APB2RST_GPIOARST_Msk                /*!< GPIOA reset */
#define CRM_APB2RST_GPIOBRST_Pos            (3U)
#define CRM_APB2RST_GPIOBRST_Msk            (0x1U << CRM_APB2RST_GPIOBRST_Pos)      /*!< 0x00000008 */
#define CRM_APB2RST_GPIOBRST                CRM_APB2RST_GPIOBRST_Msk                /*!< GPIOB reset */
#define CRM_APB2RST_GPIOCRST_Pos            (4U)
#define CRM_APB2RST_GPIOCRST_Msk            (0x1U << CRM_APB2RST_GPIOCRST_Pos)      /*!< 0x00000010 */
#define CRM_APB2RST_GPIOCRST                CRM_APB2RST_GPIOCRST_Msk                /*!< GPIOC reset */
#define CRM_APB2RST_GPIODRST_Pos            (5U)
#define CRM_APB2RST_GPIODRST_Msk            (0x1U << CRM_APB2RST_GPIODRST_Pos)      /*!< 0x00000020 */
#define CRM_APB2RST_GPIODRST                CRM_APB2RST_GPIODRST_Msk                /*!< GPIOD reset */
#define CRM_APB2RST_GPIOFRST_Pos            (7U)
#define CRM_APB2RST_GPIOFRST_Msk            (0x1U << CRM_APB2RST_GPIOFRST_Pos)      /*!< 0x00000080 */
#define CRM_APB2RST_GPIOFRST                CRM_APB2RST_GPIOFRST_Msk                /*!< GPIOF reset */
#define CRM_APB2RST_ADC1RST_Pos             (9U)
#define CRM_APB2RST_ADC1RST_Msk             (0x1U << CRM_APB2RST_ADC1RST_Pos)       /*!< 0x00000200 */
#define CRM_APB2RST_ADC1RST                 CRM_APB2RST_ADC1RST_Msk                 /*!< ADC1 reset */
#define CRM_APB2RST_TMR1RST_Pos             (11U)
#define CRM_APB2RST_TMR1RST_Msk             (0x1U << CRM_APB2RST_TMR1RST_Pos)       /*!< 0x00000800 */
#define CRM_APB2RST_TMR1RST                 CRM_APB2RST_TMR1RST_Msk                 /*!< TMR1 reset */
#define CRM_APB2RST_SPI1RST_Pos             (12U)
#define CRM_APB2RST_SPI1RST_Msk             (0x1U << CRM_APB2RST_SPI1RST_Pos)       /*!< 0x00001000 */
#define CRM_APB2RST_SPI1RST                 CRM_APB2RST_SPI1RST_Msk                 /*!< SPI1 reset */
#define CRM_APB2RST_USART1RST_Pos           (14U)
#define CRM_APB2RST_USART1RST_Msk           (0x1U << CRM_APB2RST_USART1RST_Pos)     /*!< 0x00004000 */
#define CRM_APB2RST_USART1RST               CRM_APB2RST_USART1RST_Msk               /*!< USART1 reset */
#define CRM_APB2RST_TMR9RST_Pos             (19U)
#define CRM_APB2RST_TMR9RST_Msk             (0x1U << CRM_APB2RST_TMR9RST_Pos)       /*!< 0x00080000 */
#define CRM_APB2RST_TMR9RST                 CRM_APB2RST_TMR9RST_Msk                 /*!< TMR9 reset */
#define CRM_APB2RST_TMR10RST_Pos            (20U)
#define CRM_APB2RST_TMR10RST_Msk            (0x1U << CRM_APB2RST_TMR10RST_Pos)      /*!< 0x00100000 */
#define CRM_APB2RST_TMR10RST                CRM_APB2RST_TMR10RST_Msk                /*!< TMR10 reset */
#define CRM_APB2RST_TMR11RST_Pos            (21U)
#define CRM_APB2RST_TMR11RST_Msk            (0x1U << CRM_APB2RST_TMR11RST_Pos)      /*!< 0x00200000 */
#define CRM_APB2RST_TMR11RST                CRM_APB2RST_TMR11RST_Msk                /*!< TMR11 reset */

/*****************  Bit definition for CRM_APB1RST register  ******************/
#define CRM_APB1RST_TMR2RST_Pos             (0U)
#define CRM_APB1RST_TMR2RST_Msk             (0x1U << CRM_APB1RST_TMR2RST_Pos)       /*!< 0x00000001 */
#define CRM_APB1RST_TMR2RST                 CRM_APB1RST_TMR2RST_Msk                 /*!< TMR2 reset */
#define CRM_APB1RST_TMR3RST_Pos             (1U)
#define CRM_APB1RST_TMR3RST_Msk             (0x1U << CRM_APB1RST_TMR3RST_Pos)       /*!< 0x00000002 */
#define CRM_APB1RST_TMR3RST                 CRM_APB1RST_TMR3RST_Msk                 /*!< TMR3 reset */
#define CRM_APB1RST_TMR4RST_Pos             (2U)
#define CRM_APB1RST_TMR4RST_Msk             (0x1U << CRM_APB1RST_TMR4RST_Pos)       /*!< 0x00000004 */
#define CRM_APB1RST_TMR4RST                 CRM_APB1RST_TMR4RST_Msk                 /*!< TMR4 reset */
#define CRM_APB1RST_TMR5RST_Pos             (3U)
#define CRM_APB1RST_TMR5RST_Msk             (0x1U << CRM_APB1RST_TMR5RST_Pos)       /*!< 0x00000008 */
#define CRM_APB1RST_TMR5RST                 CRM_APB1RST_TMR5RST_Msk                 /*!< TMR5 reset */
#define CRM_APB1RST_CMPRST_Pos              (9U)
#define CRM_APB1RST_CMPRST_Msk              (0x1U << CRM_APB1RST_CMPRST_Pos)        /*!< 0x00000200 */
#define CRM_APB1RST_CMPRST                  CRM_APB1RST_CMPRST_Msk                  /*!< CMP reset */
#define CRM_APB1RST_WWDTRST_Pos             (11U)
#define CRM_APB1RST_WWDTRST_Msk             (0x1U << CRM_APB1RST_WWDTRST_Pos)       /*!< 0x00000800 */
#define CRM_APB1RST_WWDTRST                 CRM_APB1RST_WWDTRST_Msk                 /*!< WWDT reset */
#define CRM_APB1RST_SPI2RST_Pos             (14U)
#define CRM_APB1RST_SPI2RST_Msk             (0x1U << CRM_APB1RST_SPI2RST_Pos)       /*!< 0x00004000 */
#define CRM_APB1RST_SPI2RST                 CRM_APB1RST_SPI2RST_Msk                 /*!< SPI2 reset */
#define CRM_APB1RST_USART2RST_Pos           (17U)
#define CRM_APB1RST_USART2RST_Msk           (0x1U << CRM_APB1RST_USART2RST_Pos)     /*!< 0x00020000 */
#define CRM_APB1RST_USART2RST               CRM_APB1RST_USART2RST_Msk               /*!< USART2 reset */
#define CRM_APB1RST_USART3RST_Pos           (18U)
#define CRM_APB1RST_USART3RST_Msk           (0x1U << CRM_APB1RST_USART3RST_Pos)     /*!< 0x00040000 */
#define CRM_APB1RST_USART3RST               CRM_APB1RST_USART3RST_Msk               /*!< USART3 reset */
#define CRM_APB1RST_UART4RST_Pos            (19U)
#define CRM_APB1RST_UART4RST_Msk            (0x1U << CRM_APB1RST_UART4RST_Pos)      /*!< 0x00080000 */
#define CRM_APB1RST_UART4RST                CRM_APB1RST_UART4RST_Msk                /*!< UART4 reset */
#define CRM_APB1RST_UART5RST_Pos            (20U)
#define CRM_APB1RST_UART5RST_Msk            (0x1U << CRM_APB1RST_UART5RST_Pos)      /*!< 0x00100000 */
#define CRM_APB1RST_UART5RST                CRM_APB1RST_UART5RST_Msk                /*!< UART5 reset */
#define CRM_APB1RST_I2C1RST_Pos             (21U)
#define CRM_APB1RST_I2C1RST_Msk             (0x1U << CRM_APB1RST_I2C1RST_Pos)       /*!< 0x00200000 */
#define CRM_APB1RST_I2C1RST                 CRM_APB1RST_I2C1RST_Msk                 /*!< I2C1 reset */
#define CRM_APB1RST_I2C2RST_Pos             (22U)
#define CRM_APB1RST_I2C2RST_Msk             (0x1U << CRM_APB1RST_I2C2RST_Pos)       /*!< 0x00400000 */
#define CRM_APB1RST_I2C2RST                 CRM_APB1RST_I2C2RST_Msk                 /*!< I2C2 reset */
#define CRM_APB1RST_CAN1RST_Pos             (25U)
#define CRM_APB1RST_CAN1RST_Msk             (0x1U << CRM_APB1RST_CAN1RST_Pos)       /*!< 0x02000000 */
#define CRM_APB1RST_CAN1RST                 CRM_APB1RST_CAN1RST_Msk                 /*!< CAN1 reset */
#define CRM_APB1RST_PWCRST_Pos              (28U)
#define CRM_APB1RST_PWCRST_Msk              (0x1U << CRM_APB1RST_PWCRST_Pos)        /*!< 0x10000000 */
#define CRM_APB1RST_PWCRST                  CRM_APB1RST_PWCRST_Msk                  /*!< PWC reset */

/******************  Bit definition for CRM_AHBEN register  *******************/
#define CRM_AHBEN_DMA1EN_Pos                (0U)
#define CRM_AHBEN_DMA1EN_Msk                (0x1U << CRM_AHBEN_DMA1EN_Pos)          /*!< 0x00000001 */
#define CRM_AHBEN_DMA1EN                    CRM_AHBEN_DMA1EN_Msk                    /*!< DMA1 clock enable */
#define CRM_AHBEN_DMA2EN_Pos                (1U)
#define CRM_AHBEN_DMA2EN_Msk                (0x1U << CRM_AHBEN_DMA2EN_Pos)          /*!< 0x00000002 */
#define CRM_AHBEN_DMA2EN                    CRM_AHBEN_DMA2EN_Msk                    /*!< DMA2 clock enable */
#define CRM_AHBEN_SRAMEN_Pos                (2U)
#define CRM_AHBEN_SRAMEN_Msk                (0x1U << CRM_AHBEN_SRAMEN_Pos)          /*!< 0x00000004 */
#define CRM_AHBEN_SRAMEN                    CRM_AHBEN_SRAMEN_Msk                    /*!< SRAM clock enable */
#define CRM_AHBEN_FLASHEN_Pos               (4U)
#define CRM_AHBEN_FLASHEN_Msk               (0x1U << CRM_AHBEN_FLASHEN_Pos)         /*!< 0x00000010 */
#define CRM_AHBEN_FLASHEN                   CRM_AHBEN_FLASHEN_Msk                   /*!< Flash clock enable */
#define CRM_AHBEN_CRCEN_Pos                 (6U)
#define CRM_AHBEN_CRCEN_Msk                 (0x1U << CRM_AHBEN_CRCEN_Pos)           /*!< 0x00000040 */
#define CRM_AHBEN_CRCEN                     CRM_AHBEN_CRCEN_Msk                     /*!< CRC clock enable */
#define CRM_AHBEN_SDIOEN_Pos                (10U)
#define CRM_AHBEN_SDIOEN_Msk                (0x1U << CRM_AHBEN_SDIOEN_Pos)          /*!< 0x00000400 */
#define CRM_AHBEN_SDIOEN                    CRM_AHBEN_SDIOEN_Msk                    /*!< SDIO clock enable */
#define CRM_AHBEN_OTGFSEN_Pos               (12U)
#define CRM_AHBEN_OTGFSEN_Msk               (0x1U << CRM_AHBEN_OTGFSEN_Pos)         /*!< 0x00001000 */
#define CRM_AHBEN_OTGFSEN                   CRM_AHBEN_OTGFSEN_Msk                   /*!< OTGFS clock enable */

/******************  Bit definition for CRM_APB2EN register  ******************/
#define CRM_APB2EN_IOMUXEN_Pos              (0U)
#define CRM_APB2EN_IOMUXEN_Msk              (0x1U << CRM_APB2EN_IOMUXEN_Pos)        /*!< 0x00000001 */
#define CRM_APB2EN_IOMUXEN                  CRM_APB2EN_IOMUXEN_Msk                  /*!< IOMUX clock enable */
#define CRM_APB2EN_GPIOAEN_Pos              (2U)
#define CRM_APB2EN_GPIOAEN_Msk              (0x1U << CRM_APB2EN_GPIOAEN_Pos)        /*!< 0x00000004 */
#define CRM_APB2EN_GPIOAEN                  CRM_APB2EN_GPIOAEN_Msk                  /*!< GPIOA clock enable */
#define CRM_APB2EN_GPIOBEN_Pos              (3U)
#define CRM_APB2EN_GPIOBEN_Msk              (0x1U << CRM_APB2EN_GPIOBEN_Pos)        /*!< 0x00000008 */
#define CRM_APB2EN_GPIOBEN                  CRM_APB2EN_GPIOBEN_Msk                  /*!< GPIOB clock enable */
#define CRM_APB2EN_GPIOCEN_Pos              (4U)
#define CRM_APB2EN_GPIOCEN_Msk              (0x1U << CRM_APB2EN_GPIOCEN_Pos)        /*!< 0x00000010 */
#define CRM_APB2EN_GPIOCEN                  CRM_APB2EN_GPIOCEN_Msk                  /*!< GPIOC clock enable */
#define CRM_APB2EN_GPIODEN_Pos              (5U)
#define CRM_APB2EN_GPIODEN_Msk              (0x1U << CRM_APB2EN_GPIODEN_Pos)        /*!< 0x00000020 */
#define CRM_APB2EN_GPIODEN                  CRM_APB2EN_GPIODEN_Msk                  /*!< GPIOD clock enable */
#define CRM_APB2EN_GPIOFEN_Pos              (7U)
#define CRM_APB2EN_GPIOFEN_Msk              (0x1U << CRM_APB2EN_GPIOFEN_Pos)        /*!< 0x00000080 */
#define CRM_APB2EN_GPIOFEN                  CRM_APB2EN_GPIOFEN_Msk                  /*!< GPIOF clock enable */
#define CRM_APB2EN_ADC1EN_Pos               (9U)
#define CRM_APB2EN_ADC1EN_Msk               (0x1U << CRM_APB2EN_ADC1EN_Pos)         /*!< 0x00000200 */
#define CRM_APB2EN_ADC1EN                   CRM_APB2EN_ADC1EN_Msk                   /*!< ADC1 clock enable */
#define CRM_APB2EN_TMR1EN_Pos               (11U)
#define CRM_APB2EN_TMR1EN_Msk               (0x1U << CRM_APB2EN_TMR1EN_Pos)         /*!< 0x00000800 */
#define CRM_APB2EN_TMR1EN                   CRM_APB2EN_TMR1EN_Msk                   /*!< TMR1 clock enable */
#define CRM_APB2EN_SPI1EN_Pos               (12U)
#define CRM_APB2EN_SPI1EN_Msk               (0x1U << CRM_APB2EN_SPI1EN_Pos)         /*!< 0x00001000 */
#define CRM_APB2EN_SPI1EN                   CRM_APB2EN_SPI1EN_Msk                   /*!< SPI1 clock enable */
#define CRM_APB2EN_USART1EN_Pos             (14U)
#define CRM_APB2EN_USART1EN_Msk             (0x1U << CRM_APB2EN_USART1EN_Pos)       /*!< 0x00004000 */
#define CRM_APB2EN_USART1EN                 CRM_APB2EN_USART1EN_Msk                 /*!< USART1 clock enable */
#define CRM_APB2EN_TMR9EN_Pos               (19U)
#define CRM_APB2EN_TMR9EN_Msk               (0x1U << CRM_APB2EN_TMR9EN_Pos)         /*!< 0x00080000 */
#define CRM_APB2EN_TMR9EN                   CRM_APB2EN_TMR9EN_Msk                   /*!< TMR9 clock enable */
#define CRM_APB2EN_TMR10EN_Pos              (20U)
#define CRM_APB2EN_TMR10EN_Msk              (0x1U << CRM_APB2EN_TMR10EN_Pos)        /*!< 0x00100000 */
#define CRM_APB2EN_TMR10EN                  CRM_APB2EN_TMR10EN_Msk                  /*!< TMR10 clock enable */
#define CRM_APB2EN_TMR11EN_Pos              (21U)
#define CRM_APB2EN_TMR11EN_Msk              (0x1U << CRM_APB2EN_TMR11EN_Pos)        /*!< 0x00200000 */
#define CRM_APB2EN_TMR11EN                  CRM_APB2EN_TMR11EN_Msk                  /*!< TMR11 clock enable */

