ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415rx.h
#define IOMUX_REMAP6_CAN1_GMUX_MUX0         0x00000000U                             /*!< RX/PA11, TX/PA12 */
#define IOMUX_REMAP6_CAN1_GMUX_MUX2_Pos     (1U)                                    /*!< 0x00000002 */
#define IOMUX_REMAP6_CAN1_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP6_CAN1_GMUX_MUX2_Pos)
#define IOMUX_REMAP6_CAN1_GMUX_MUX2         IOMUX_REMAP6_CAN1_GMUX_MUX2_Msk         /*!< RX/PB8, TX/PB9 */

/*!< SDIO_GMUX configuration */
#define IOMUX_REMAP6_SDIO_GMUX_Pos          (8U)
#define IOMUX_REMAP6_SDIO_GMUX_Msk          (0xFU << IOMUX_REMAP6_SDIO_GMUX_Pos)    /*!< 0x00000F00 */
#define IOMUX_REMAP6_SDIO_GMUX              IOMUX_REMAP6_SDIO_GMUX_Msk              /*!< SDIO_GMUX[3:0] bits (SDIO IO general multiplexing) */
#define IOMUX_REMAP6_SDIO_GMUX_0            (0x1U << IOMUX_REMAP6_SDIO_GMUX_Pos)    /*!< 0x00000100 */
#define IOMUX_REMAP6_SDIO_GMUX_1            (0x2U << IOMUX_REMAP6_SDIO_GMUX_Pos)    /*!< 0x00000200 */
#define IOMUX_REMAP6_SDIO_GMUX_2            (0x4U << IOMUX_REMAP6_SDIO_GMUX_Pos)    /*!< 0x00000400 */
#define IOMUX_REMAP6_SDIO_GMUX_3            (0x8U << IOMUX_REMAP6_SDIO_GMUX_Pos)    /*!< 0x00000800 */

#define IOMUX_REMAP6_SDIO_GMUX_MUX0         0x00000000U                             /*!< D0/PC8, D1/PC9, D2/PC10, D3/PC11, D4/PB8, D5/PB9, D6/PC6, D7/PC7, CK/PC12, CMD/PD2 */
#define IOMUX_REMAP6_SDIO_GMUX_MUX4_Pos     (10U)                                   /*!< 0x00000400 */
#define IOMUX_REMAP6_SDIO_GMUX_MUX4_Msk     (0x1U << IOMUX_REMAP6_SDIO_GMUX_MUX4_Pos)
#define IOMUX_REMAP6_SDIO_GMUX_MUX4         IOMUX_REMAP6_SDIO_GMUX_MUX4_Msk         /*!< D0/PC0, D1/PC1, D2/PC2, D3/PC3, D4/PA4, D5/PA5, D6/PA6, D7/PA7, CK/PC4, CMD/PC5 */
#define IOMUX_REMAP6_SDIO_GMUX_MUX5_Pos     (8U)                                    /*!< 0x00000500 */
#define IOMUX_REMAP6_SDIO_GMUX_MUX5_Msk     (0x5U << IOMUX_REMAP6_SDIO_GMUX_MUX5_Pos)
#define IOMUX_REMAP6_SDIO_GMUX_MUX5         IOMUX_REMAP6_SDIO_GMUX_MUX5_Msk         /*!< D0/PA4, D1/PA5, D2/PA6, D3/PA7, CK/PC4, CMD/PC5 */
#define IOMUX_REMAP6_SDIO_GMUX_MUX6_Pos     (9U)                                    /*!< 0x00000600 */
#define IOMUX_REMAP6_SDIO_GMUX_MUX6_Msk     (0x3U << IOMUX_REMAP6_SDIO_GMUX_MUX6_Pos)
#define IOMUX_REMAP6_SDIO_GMUX_MUX6         IOMUX_REMAP6_SDIO_GMUX_MUX6_Msk         /*!< D0/PC0, D1/PC1, D2/PC2, D3/PC3, D4/PA4, D5/PA5, D6/PA6, D7/PA7, CK/PA2, CMD/PA3 */
#define IOMUX_REMAP6_SDIO_GMUX_MUX7_Pos     (8U)                                    /*!< 0x00000700 */
#define IOMUX_REMAP6_SDIO_GMUX_MUX7_Msk     (0x7U << IOMUX_REMAP6_SDIO_GMUX_MUX7_Pos)
#define IOMUX_REMAP6_SDIO_GMUX_MUX7         IOMUX_REMAP6_SDIO_GMUX_MUX7_Msk         /*!< D0/PA4, D1/PA5, D2/PA6, D3/PA7, CK/PA2, CMD/PA3 */

/*!< USART1_GMUX configuration */
#define IOMUX_REMAP6_USART1_GMUX_Pos        (16U)
#define IOMUX_REMAP6_USART1_GMUX_Msk        (0xFU << IOMUX_REMAP6_USART1_GMUX_Pos)  /*!< 0x000F0000 */
#define IOMUX_REMAP6_USART1_GMUX            IOMUX_REMAP6_USART1_GMUX_Msk            /*!< USART1_GMUX[3:0] bits (USART1 IO general multiplexing) */
#define IOMUX_REMAP6_USART1_GMUX_0          (0x1U << IOMUX_REMAP6_USART1_GMUX_Pos)  /*!< 0x00010000 */
#define IOMUX_REMAP6_USART1_GMUX_1          (0x2U << IOMUX_REMAP6_USART1_GMUX_Pos)  /*!< 0x00020000 */
#define IOMUX_REMAP6_USART1_GMUX_2          (0x4U << IOMUX_REMAP6_USART1_GMUX_Pos)  /*!< 0x00040000 */
#define IOMUX_REMAP6_USART1_GMUX_3          (0x8U << IOMUX_REMAP6_USART1_GMUX_Pos)  /*!< 0x00080000 */

#define IOMUX_REMAP6_USART1_GMUX_MUX0       0x00000000U                             /*!< TX/PA9, RX/PA10 */
#define IOMUX_REMAP6_USART1_GMUX_MUX1_Pos   (16U)                                   /*!< 0x00010000 */
#define IOMUX_REMAP6_USART1_GMUX_MUX1_Msk   (0x1U << IOMUX_REMAP6_USART1_GMUX_MUX1_Pos)
#define IOMUX_REMAP6_USART1_GMUX_MUX1       IOMUX_REMAP6_USART1_GMUX_MUX1_Msk       /*!< TX/PB6, RX/PB7 */

/*!< USART3_GMUX configuration */
#define IOMUX_REMAP6_USART3_GMUX_Pos        (24U)
#define IOMUX_REMAP6_USART3_GMUX_Msk        (0xFU << IOMUX_REMAP6_USART3_GMUX_Pos)  /*!< 0x0F000000 */
#define IOMUX_REMAP6_USART3_GMUX            IOMUX_REMAP6_USART3_GMUX_Msk            /*!< USART3_GMUX[3:0] bits (USART3 IO general multiplexing) */
#define IOMUX_REMAP6_USART3_GMUX_0          (0x1U << IOMUX_REMAP6_USART3_GMUX_Pos)  /*!< 0x01000000 */
#define IOMUX_REMAP6_USART3_GMUX_1          (0x2U << IOMUX_REMAP6_USART3_GMUX_Pos)  /*!< 0x02000000 */
#define IOMUX_REMAP6_USART3_GMUX_2          (0x4U << IOMUX_REMAP6_USART3_GMUX_Pos)  /*!< 0x04000000 */
#define IOMUX_REMAP6_USART3_GMUX_3          (0x8U << IOMUX_REMAP6_USART3_GMUX_Pos)  /*!< 0x08000000 */

#define IOMUX_REMAP6_USART3_GMUX_MUX0       0x00000000U                             /*!< TX/PB10, RX/PB11, CK/PB12, CTS/PB13, RTS/PB14 */
#define IOMUX_REMAP6_USART3_GMUX_MUX1_Pos   (24U)                                   /*!< 0x01000000 */
#define IOMUX_REMAP6_USART3_GMUX_MUX1_Msk   (0x1U << IOMUX_REMAP6_USART3_GMUX_MUX1_Pos)
#define IOMUX_REMAP6_USART3_GMUX_MUX1       IOMUX_REMAP6_USART3_GMUX_MUX1_Msk       /*!< TX/PC10, RX/PC11, CK/PC12, CTS/PB13, RTS/PB14 */
#define IOMUX_REMAP6_USART3_GMUX_MUX2_Pos   (25U)                                   /*!< 0x02000000 */
#define IOMUX_REMAP6_USART3_GMUX_MUX2_Msk   (0x1U << IOMUX_REMAP6_USART3_GMUX_MUX2_Pos)
#define IOMUX_REMAP6_USART3_GMUX_MUX2       IOMUX_REMAP6_USART3_GMUX_MUX2_Msk       /*!< TX/PA7, RX/PA6, CK/PA5, CTS/PB1, RTS/PB0 */

/*!< UART4_GMUX configuration */
#define IOMUX_REMAP6_UART4_GMUX_Pos         (28U)
#define IOMUX_REMAP6_UART4_GMUX_Msk         (0xFU << IOMUX_REMAP6_UART4_GMUX_Pos)   /*!< 0xF0000000 */
#define IOMUX_REMAP6_UART4_GMUX             IOMUX_REMAP6_UART4_GMUX_Msk             /*!< UART4_GMUX[3:0] bits (UART4 IO general multiplexing) */
#define IOMUX_REMAP6_UART4_GMUX_0           (0x1U << IOMUX_REMAP6_UART4_GMUX_Pos)   /*!< 0x10000000 */
#define IOMUX_REMAP6_UART4_GMUX_1           (0x2U << IOMUX_REMAP6_UART4_GMUX_Pos)   /*!< 0x20000000 */
#define IOMUX_REMAP6_UART4_GMUX_2           (0x4U << IOMUX_REMAP6_UART4_GMUX_Pos)   /*!< 0x40000000 */
#define IOMUX_REMAP6_UART4_GMUX_3           (0x8U << IOMUX_REMAP6_UART4_GMUX_Pos)   /*!< 0x80000000 */

#define IOMUX_REMAP6_UART4_GMUX_MUX0        0x00000000U                             /*!< TX/PC10, RX/PC11 */
#define IOMUX_REMAP6_UART4_GMUX_MUX1_Pos    (28U)                                   /*!< 0x10000000 */
#define IOMUX_REMAP6_UART4_GMUX_MUX1_Msk    (0x1U << IOMUX_REMAP6_UART4_GMUX_MUX1_Pos)
#define IOMUX_REMAP6_UART4_GMUX_MUX1        IOMUX_REMAP6_UART4_GMUX_MUX1_Msk        /*!< TX/PF4, RX/PF5 */

/*****************  Bit definition for IOMUX_REMAP7 register  *****************/
#define IOMUX_REMAP7_ADC1_ETP_GMUX_Pos      (4U)                                    /*!< 0x00000010 */
#define IOMUX_REMAP7_ADC1_ETP_GMUX_Msk      (0x1U << IOMUX_REMAP7_ADC1_ETP_GMUX_Pos)
#define IOMUX_REMAP7_ADC1_ETP_GMUX          IOMUX_REMAP7_ADC1_ETP_GMUX_Msk          /*!< ADC1 external trigger preempted conversion general multiplexing */
#define IOMUX_REMAP7_ADC1_ETO_GMUX_Pos      (5U)                                    /*!< 0x00000020 */
#define IOMUX_REMAP7_ADC1_ETO_GMUX_Msk      (0x1U << IOMUX_REMAP7_ADC1_ETO_GMUX_Pos)
#define IOMUX_REMAP7_ADC1_ETO_GMUX          IOMUX_REMAP7_ADC1_ETO_GMUX_Msk          /*!< ADC1 external trigger ordinary conversion general multiplexing */

/*!< SWJTAG_GMUX configuration */
#define IOMUX_REMAP7_SWJTAG_GMUX_Pos        (16U)
#define IOMUX_REMAP7_SWJTAG_GMUX_Msk        (0x7U << IOMUX_REMAP7_SWJTAG_GMUX_Pos)  /*!< 0x00070000 */
#define IOMUX_REMAP7_SWJTAG_GMUX            IOMUX_REMAP7_SWJTAG_GMUX_Msk            /*!< SWJTAG_GMUX[2:0] bits (SWD_JTAG IO general multiplexing) */
#define IOMUX_REMAP7_SWJTAG_GMUX_0          (0x1U << IOMUX_REMAP7_SWJTAG_GMUX_Pos)  /*!< 0x00010000 */
#define IOMUX_REMAP7_SWJTAG_GMUX_1          (0x2U << IOMUX_REMAP7_SWJTAG_GMUX_Pos)  /*!< 0x00020000 */
#define IOMUX_REMAP7_SWJTAG_GMUX_2          (0x4U << IOMUX_REMAP7_SWJTAG_GMUX_Pos)  /*!< 0x00040000 */

#define IOMUX_REMAP7_SWJTAG_GMUX_RESET        0x00000000U                           /*!< Supports SWD and JTAG. All SWJTAG pins cannot be used as GPIO */
#define IOMUX_REMAP7_SWJTAG_GMUX_NONJTRST_Pos (16U)                                 /*!< 0x00010000 */
#define IOMUX_REMAP7_SWJTAG_GMUX_NONJTRST_Msk (0x1U << IOMUX_REMAP7_SWJTAG_GMUX_NONJTRST_Pos)
#define IOMUX_REMAP7_SWJTAG_GMUX_NONJTRST     IOMUX_REMAP7_SWJTAG_GMUX_NONJTRST_Msk /*!< Supports SWD and JTAG. NJTRST is disabled. PB4 can be used as GPIO */
#define IOMUX_REMAP7_SWJTAG_GMUX_JTAGDIS_Pos  (17U)                                 /*!< 0x00020000 */
#define IOMUX_REMAP7_SWJTAG_GMUX_JTAGDIS_Msk  (0x1U << IOMUX_REMAP7_SWJTAG_GMUX_JTAGDIS_Pos)
#define IOMUX_REMAP7_SWJTAG_GMUX_JTAGDIS      IOMUX_REMAP7_SWJTAG_GMUX_JTAGDIS_Msk  /*!< Supports SWD. But JTAG is disabled. PA15/PB3/PB4 can be used as GPIO */
#define IOMUX_REMAP7_SWJTAG_GMUX_DISABLE_Pos  (18U)                                 /*!< 0x00040000 */
#define IOMUX_REMAP7_SWJTAG_GMUX_DISABLE_Msk  (0x1U << IOMUX_REMAP7_SWJTAG_GMUX_DISABLE_Pos)
#define IOMUX_REMAP7_SWJTAG_GMUX_DISABLE      IOMUX_REMAP7_SWJTAG_GMUX_DISABLE_Msk  /*!< SWD and JTAG are disabled. All SWJTAG pins can be used as GPIO */

#define IOMUX_REMAP7_PD01_GMUX_Pos          (20U)
#define IOMUX_REMAP7_PD01_GMUX_Msk          (0x1U << IOMUX_REMAP7_PD01_GMUX_Pos)    /*!< 0x00100000 */
#define IOMUX_REMAP7_PD01_GMUX              IOMUX_REMAP7_PD01_GMUX_Msk              /*!< PD0/PD1 mapped onto HEXT_IN / HEXT_OUT */

