ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415rx.h
/****************  Bit definition for EXINT_POLCFG2 register  *****************/
#define EXINT_POLCFG2_FP0_Pos               (0U)
#define EXINT_POLCFG2_FP0_Msk               (0x1U << EXINT_POLCFG2_FP0_Pos)         /*!< 0x00000001 */
#define EXINT_POLCFG2_FP0                   EXINT_POLCFG2_FP0_Msk                   /*!< Falling edge event configuration bit on line 0 */
#define EXINT_POLCFG2_FP1_Pos               (1U)
#define EXINT_POLCFG2_FP1_Msk               (0x1U << EXINT_POLCFG2_FP1_Pos)         /*!< 0x00000002 */
#define EXINT_POLCFG2_FP1                   EXINT_POLCFG2_FP1_Msk                   /*!< Falling edge event configuration bit on line 1 */
#define EXINT_POLCFG2_FP2_Pos               (2U)
#define EXINT_POLCFG2_FP2_Msk               (0x1U << EXINT_POLCFG2_FP2_Pos)         /*!< 0x00000004 */
#define EXINT_POLCFG2_FP2                   EXINT_POLCFG2_FP2_Msk                   /*!< Falling edge event configuration bit on line 2 */
#define EXINT_POLCFG2_FP3_Pos               (3U)
#define EXINT_POLCFG2_FP3_Msk               (0x1U << EXINT_POLCFG2_FP3_Pos)         /*!< 0x00000008 */
#define EXINT_POLCFG2_FP3                   EXINT_POLCFG2_FP3_Msk                   /*!< Falling edge event configuration bit on line 3 */
#define EXINT_POLCFG2_FP4_Pos               (4U)
#define EXINT_POLCFG2_FP4_Msk               (0x1U << EXINT_POLCFG2_FP4_Pos)         /*!< 0x00000010 */
#define EXINT_POLCFG2_FP4                   EXINT_POLCFG2_FP4_Msk                   /*!< Falling edge event configuration bit on line 4 */
#define EXINT_POLCFG2_FP5_Pos               (5U)
#define EXINT_POLCFG2_FP5_Msk               (0x1U << EXINT_POLCFG2_FP5_Pos)         /*!< 0x00000020 */
#define EXINT_POLCFG2_FP5                   EXINT_POLCFG2_FP5_Msk                   /*!< Falling edge event configuration bit on line 5 */
#define EXINT_POLCFG2_FP6_Pos               (6U)
#define EXINT_POLCFG2_FP6_Msk               (0x1U << EXINT_POLCFG2_FP6_Pos)         /*!< 0x00000040 */
#define EXINT_POLCFG2_FP6                   EXINT_POLCFG2_FP6_Msk                   /*!< Falling edge event configuration bit on line 6 */
#define EXINT_POLCFG2_FP7_Pos               (7U)
#define EXINT_POLCFG2_FP7_Msk               (0x1U << EXINT_POLCFG2_FP7_Pos)         /*!< 0x00000080 */
#define EXINT_POLCFG2_FP7                   EXINT_POLCFG2_FP7_Msk                   /*!< Falling edge event configuration bit on line 7 */
#define EXINT_POLCFG2_FP8_Pos               (8U)
#define EXINT_POLCFG2_FP8_Msk               (0x1U << EXINT_POLCFG2_FP8_Pos)         /*!< 0x00000100 */
#define EXINT_POLCFG2_FP8                   EXINT_POLCFG2_FP8_Msk                   /*!< Falling edge event configuration bit on line 8 */
#define EXINT_POLCFG2_FP9_Pos               (9U)
#define EXINT_POLCFG2_FP9_Msk               (0x1U << EXINT_POLCFG2_FP9_Pos)         /*!< 0x00000200 */
#define EXINT_POLCFG2_FP9                   EXINT_POLCFG2_FP9_Msk                   /*!< Falling edge event configuration bit on line 9 */
#define EXINT_POLCFG2_FP10_Pos              (10U)
#define EXINT_POLCFG2_FP10_Msk              (0x1U << EXINT_POLCFG2_FP10_Pos)        /*!< 0x00000400 */
#define EXINT_POLCFG2_FP10                  EXINT_POLCFG2_FP10_Msk                  /*!< Falling edge event configuration bit on line 10 */
#define EXINT_POLCFG2_FP11_Pos              (11U)
#define EXINT_POLCFG2_FP11_Msk              (0x1U << EXINT_POLCFG2_FP11_Pos)        /*!< 0x00000800 */
#define EXINT_POLCFG2_FP11                  EXINT_POLCFG2_FP11_Msk                  /*!< Falling edge event configuration bit on line 11 */
#define EXINT_POLCFG2_FP12_Pos              (12U)
#define EXINT_POLCFG2_FP12_Msk              (0x1U << EXINT_POLCFG2_FP12_Pos)        /*!< 0x00001000 */
#define EXINT_POLCFG2_FP12                  EXINT_POLCFG2_FP12_Msk                  /*!< Falling edge event configuration bit on line 12 */
#define EXINT_POLCFG2_FP13_Pos              (13U)
#define EXINT_POLCFG2_FP13_Msk              (0x1U << EXINT_POLCFG2_FP13_Pos)        /*!< 0x00002000 */
#define EXINT_POLCFG2_FP13                  EXINT_POLCFG2_FP13_Msk                  /*!< Falling edge event configuration bit on line 13 */
#define EXINT_POLCFG2_FP14_Pos              (14U)
#define EXINT_POLCFG2_FP14_Msk              (0x1U << EXINT_POLCFG2_FP14_Pos)        /*!< 0x00004000 */
#define EXINT_POLCFG2_FP14                  EXINT_POLCFG2_FP14_Msk                  /*!< Falling edge event configuration bit on line 14 */
#define EXINT_POLCFG2_FP15_Pos              (15U)
#define EXINT_POLCFG2_FP15_Msk              (0x1U << EXINT_POLCFG2_FP15_Pos)        /*!< 0x00008000 */
#define EXINT_POLCFG2_FP15                  EXINT_POLCFG2_FP15_Msk                  /*!< Falling edge event configuration bit on line 15 */
#define EXINT_POLCFG2_FP16_Pos              (16U)
#define EXINT_POLCFG2_FP16_Msk              (0x1U << EXINT_POLCFG2_FP16_Pos)        /*!< 0x00010000 */
#define EXINT_POLCFG2_FP16                  EXINT_POLCFG2_FP16_Msk                  /*!< Falling edge event configuration bit on line 16 */
#define EXINT_POLCFG2_FP17_Pos              (17U)
#define EXINT_POLCFG2_FP17_Msk              (0x1U << EXINT_POLCFG2_FP17_Pos)        /*!< 0x00020000 */
#define EXINT_POLCFG2_FP17                  EXINT_POLCFG2_FP17_Msk                  /*!< Falling edge event configuration bit on line 17 */
#define EXINT_POLCFG2_FP18_Pos              (18U)
#define EXINT_POLCFG2_FP18_Msk              (0x1U << EXINT_POLCFG2_FP18_Pos)        /*!< 0x00040000 */
#define EXINT_POLCFG2_FP18                  EXINT_POLCFG2_FP18_Msk                  /*!< Falling edge event configuration bit on line 18 */
#define EXINT_POLCFG2_FP19_Pos              (19U)
#define EXINT_POLCFG2_FP19_Msk              (0x1U << EXINT_POLCFG2_FP19_Pos)        /*!< 0x00080000 */
#define EXINT_POLCFG2_FP19                  EXINT_POLCFG2_FP19_Msk                  /*!< Falling edge event configuration bit on line 19 */
#define EXINT_POLCFG2_FP20_Pos              (20U)
#define EXINT_POLCFG2_FP20_Msk              (0x1U << EXINT_POLCFG2_FP20_Pos)        /*!< 0x00100000 */
#define EXINT_POLCFG2_FP20                  EXINT_POLCFG2_FP20_Msk                  /*!< Falling edge event configuration bit on line 20 */
#define EXINT_POLCFG2_FP21_Pos              (21U)
#define EXINT_POLCFG2_FP21_Msk              (0x1U << EXINT_POLCFG2_FP21_Pos)        /*!< 0x00200000 */
#define EXINT_POLCFG2_FP21                  EXINT_POLCFG2_FP21_Msk                  /*!< Falling edge event configuration bit on line 21 */
#define EXINT_POLCFG2_FP22_Pos              (22U)
#define EXINT_POLCFG2_FP22_Msk              (0x1U << EXINT_POLCFG2_FP22_Pos)        /*!< 0x00400000 */
#define EXINT_POLCFG2_FP22                  EXINT_POLCFG2_FP22_Msk                  /*!< Falling edge event configuration bit on line 22 */

/* References defines */
#define EXINT_POLCFG2_POL0                  EXINT_POLCFG2_FP0
#define EXINT_POLCFG2_POL1                  EXINT_POLCFG2_FP1
#define EXINT_POLCFG2_POL2                  EXINT_POLCFG2_FP2
#define EXINT_POLCFG2_POL3                  EXINT_POLCFG2_FP3
#define EXINT_POLCFG2_POL4                  EXINT_POLCFG2_FP4
#define EXINT_POLCFG2_POL5                  EXINT_POLCFG2_FP5
#define EXINT_POLCFG2_POL6                  EXINT_POLCFG2_FP6
#define EXINT_POLCFG2_POL7                  EXINT_POLCFG2_FP7
#define EXINT_POLCFG2_POL8                  EXINT_POLCFG2_FP8
#define EXINT_POLCFG2_POL9                  EXINT_POLCFG2_FP9
#define EXINT_POLCFG2_POL10                 EXINT_POLCFG2_FP10
#define EXINT_POLCFG2_POL11                 EXINT_POLCFG2_FP11
#define EXINT_POLCFG2_POL12                 EXINT_POLCFG2_FP12
#define EXINT_POLCFG2_POL13                 EXINT_POLCFG2_FP13
#define EXINT_POLCFG2_POL14                 EXINT_POLCFG2_FP14
#define EXINT_POLCFG2_POL15                 EXINT_POLCFG2_FP15
#define EXINT_POLCFG2_POL16                 EXINT_POLCFG2_FP16
#define EXINT_POLCFG2_POL17                 EXINT_POLCFG2_FP17
#define EXINT_POLCFG2_POL18                 EXINT_POLCFG2_FP18
#define EXINT_POLCFG2_POL19                 EXINT_POLCFG2_FP19
#define EXINT_POLCFG2_POL20                 EXINT_POLCFG2_FP20
#define EXINT_POLCFG2_POL21                 EXINT_POLCFG2_FP21
#define EXINT_POLCFG2_POL22                 EXINT_POLCFG2_FP22

/*****************  Bit definition for EXINT_SWTRG register  ******************/
#define EXINT_SWTRG_SWT0_Pos                (0U)
#define EXINT_SWTRG_SWT0_Msk                (0x1U << EXINT_SWTRG_SWT0_Pos)          /*!< 0x00000001 */
#define EXINT_SWTRG_SWT0                    EXINT_SWTRG_SWT0_Msk                    /*!< Software trigger on line 0 */
#define EXINT_SWTRG_SWT1_Pos                (1U)
#define EXINT_SWTRG_SWT1_Msk                (0x1U << EXINT_SWTRG_SWT1_Pos)          /*!< 0x00000002 */
#define EXINT_SWTRG_SWT1                    EXINT_SWTRG_SWT1_Msk                    /*!< Software trigger on line 1 */
#define EXINT_SWTRG_SWT2_Pos                (2U)
#define EXINT_SWTRG_SWT2_Msk                (0x1U << EXINT_SWTRG_SWT2_Pos)          /*!< 0x00000004 */
#define EXINT_SWTRG_SWT2                    EXINT_SWTRG_SWT2_Msk                    /*!< Software trigger on line 2 */
#define EXINT_SWTRG_SWT3_Pos                (3U)
#define EXINT_SWTRG_SWT3_Msk                (0x1U << EXINT_SWTRG_SWT3_Pos)          /*!< 0x00000008 */
#define EXINT_SWTRG_SWT3                    EXINT_SWTRG_SWT3_Msk                    /*!< Software trigger on line 3 */
#define EXINT_SWTRG_SWT4_Pos                (4U)
#define EXINT_SWTRG_SWT4_Msk                (0x1U << EXINT_SWTRG_SWT4_Pos)          /*!< 0x00000010 */
#define EXINT_SWTRG_SWT4                    EXINT_SWTRG_SWT4_Msk                    /*!< Software trigger on line 4 */
#define EXINT_SWTRG_SWT5_Pos                (5U)
#define EXINT_SWTRG_SWT5_Msk                (0x1U << EXINT_SWTRG_SWT5_Pos)          /*!< 0x00000020 */
#define EXINT_SWTRG_SWT5                    EXINT_SWTRG_SWT5_Msk                    /*!< Software trigger on line 5 */
#define EXINT_SWTRG_SWT6_Pos                (6U)
#define EXINT_SWTRG_SWT6_Msk                (0x1U << EXINT_SWTRG_SWT6_Pos)          /*!< 0x00000040 */
#define EXINT_SWTRG_SWT6                    EXINT_SWTRG_SWT6_Msk                    /*!< Software trigger on line 6 */
#define EXINT_SWTRG_SWT7_Pos                (7U)
#define EXINT_SWTRG_SWT7_Msk                (0x1U << EXINT_SWTRG_SWT7_Pos)          /*!< 0x00000080 */
#define EXINT_SWTRG_SWT7                    EXINT_SWTRG_SWT7_Msk                    /*!< Software trigger on line 7 */
#define EXINT_SWTRG_SWT8_Pos                (8U)
#define EXINT_SWTRG_SWT8_Msk                (0x1U << EXINT_SWTRG_SWT8_Pos)          /*!< 0x00000100 */
#define EXINT_SWTRG_SWT8                    EXINT_SWTRG_SWT8_Msk                    /*!< Software trigger on line 8 */
#define EXINT_SWTRG_SWT9_Pos                (9U)
#define EXINT_SWTRG_SWT9_Msk                (0x1U << EXINT_SWTRG_SWT9_Pos)          /*!< 0x00000200 */
#define EXINT_SWTRG_SWT9                    EXINT_SWTRG_SWT9_Msk                    /*!< Software trigger on line 9 */
#define EXINT_SWTRG_SWT10_Pos               (10U)
#define EXINT_SWTRG_SWT10_Msk               (0x1U << EXINT_SWTRG_SWT10_Pos)         /*!< 0x00000400 */
#define EXINT_SWTRG_SWT10                   EXINT_SWTRG_SWT10_Msk                   /*!< Software trigger on line 10 */
#define EXINT_SWTRG_SWT11_Pos               (11U)
#define EXINT_SWTRG_SWT11_Msk               (0x1U << EXINT_SWTRG_SWT11_Pos)         /*!< 0x00000800 */
#define EXINT_SWTRG_SWT11                   EXINT_SWTRG_SWT11_Msk                   /*!< Software trigger on line 11 */
#define EXINT_SWTRG_SWT12_Pos               (12U)
#define EXINT_SWTRG_SWT12_Msk               (0x1U << EXINT_SWTRG_SWT12_Pos)         /*!< 0x00001000 */
#define EXINT_SWTRG_SWT12                   EXINT_SWTRG_SWT12_Msk                   /*!< Software trigger on line 12 */
#define EXINT_SWTRG_SWT13_Pos               (13U)
#define EXINT_SWTRG_SWT13_Msk               (0x1U << EXINT_SWTRG_SWT13_Pos)         /*!< 0x00002000 */
#define EXINT_SWTRG_SWT13                   EXINT_SWTRG_SWT13_Msk                   /*!< Software trigger on line 13 */
#define EXINT_SWTRG_SWT14_Pos               (14U)
#define EXINT_SWTRG_SWT14_Msk               (0x1U << EXINT_SWTRG_SWT14_Pos)         /*!< 0x00004000 */
#define EXINT_SWTRG_SWT14                   EXINT_SWTRG_SWT14_Msk                   /*!< Software trigger on line 14 */
#define EXINT_SWTRG_SWT15_Pos               (15U)
#define EXINT_SWTRG_SWT15_Msk               (0x1U << EXINT_SWTRG_SWT15_Pos)         /*!< 0x00008000 */
#define EXINT_SWTRG_SWT15                   EXINT_SWTRG_SWT15_Msk                   /*!< Software trigger on line 15 */
#define EXINT_SWTRG_SWT16_Pos               (16U)
#define EXINT_SWTRG_SWT16_Msk               (0x1U << EXINT_SWTRG_SWT16_Pos)         /*!< 0x00010000 */
#define EXINT_SWTRG_SWT16                   EXINT_SWTRG_SWT16_Msk                   /*!< Software trigger on line 16 */
#define EXINT_SWTRG_SWT17_Pos               (17U)
#define EXINT_SWTRG_SWT17_Msk               (0x1U << EXINT_SWTRG_SWT17_Pos)         /*!< 0x00020000 */
#define EXINT_SWTRG_SWT17                   EXINT_SWTRG_SWT17_Msk                   /*!< Software trigger on line 17 */
#define EXINT_SWTRG_SWT18_Pos               (18U)
#define EXINT_SWTRG_SWT18_Msk               (0x1U << EXINT_SWTRG_SWT18_Pos)         /*!< 0x00040000 */
#define EXINT_SWTRG_SWT18                   EXINT_SWTRG_SWT18_Msk                   /*!< Software trigger on line 18 */
#define EXINT_SWTRG_SWT19_Pos               (19U)
#define EXINT_SWTRG_SWT19_Msk               (0x1U << EXINT_SWTRG_SWT19_Pos)         /*!< 0x00080000 */
#define EXINT_SWTRG_SWT19                   EXINT_SWTRG_SWT19_Msk                   /*!< Software trigger on line 19 */
#define EXINT_SWTRG_SWT20_Pos               (20U)
#define EXINT_SWTRG_SWT20_Msk               (0x1U << EXINT_SWTRG_SWT20_Pos)         /*!< 0x00100000 */
#define EXINT_SWTRG_SWT20                   EXINT_SWTRG_SWT20_Msk                   /*!< Software trigger on line 20 */
#define EXINT_SWTRG_SWT21_Pos               (21U)
#define EXINT_SWTRG_SWT21_Msk               (0x1U << EXINT_SWTRG_SWT21_Pos)         /*!< 0x00200000 */
#define EXINT_SWTRG_SWT21                   EXINT_SWTRG_SWT21_Msk                   /*!< Software trigger on line 21 */
#define EXINT_SWTRG_SWT22_Pos               (22U)
#define EXINT_SWTRG_SWT22_Msk               (0x1U << EXINT_SWTRG_SWT22_Pos)         /*!< 0x00400000 */
#define EXINT_SWTRG_SWT22                   EXINT_SWTRG_SWT22_Msk                   /*!< Software trigger on line 22 */

/* References defines */
#define EXINT_SWTRG_SW0                     EXINT_SWTRG_SWT0
#define EXINT_SWTRG_SW1                     EXINT_SWTRG_SWT1
#define EXINT_SWTRG_SW2                     EXINT_SWTRG_SWT2
#define EXINT_SWTRG_SW3                     EXINT_SWTRG_SWT3
#define EXINT_SWTRG_SW4                     EXINT_SWTRG_SWT4
#define EXINT_SWTRG_SW5                     EXINT_SWTRG_SWT5
#define EXINT_SWTRG_SW6                     EXINT_SWTRG_SWT6
#define EXINT_SWTRG_SW7                     EXINT_SWTRG_SWT7
#define EXINT_SWTRG_SW8                     EXINT_SWTRG_SWT8
#define EXINT_SWTRG_SW9                     EXINT_SWTRG_SWT9
#define EXINT_SWTRG_SW10                    EXINT_SWTRG_SWT10
#define EXINT_SWTRG_SW11                    EXINT_SWTRG_SWT11
#define EXINT_SWTRG_SW12                    EXINT_SWTRG_SWT12
#define EXINT_SWTRG_SW13                    EXINT_SWTRG_SWT13
#define EXINT_SWTRG_SW14                    EXINT_SWTRG_SWT14
#define EXINT_SWTRG_SW15                    EXINT_SWTRG_SWT15
#define EXINT_SWTRG_SW16                    EXINT_SWTRG_SWT16
#define EXINT_SWTRG_SW17                    EXINT_SWTRG_SWT17
#define EXINT_SWTRG_SW18                    EXINT_SWTRG_SWT18
#define EXINT_SWTRG_SW19                    EXINT_SWTRG_SWT19
#define EXINT_SWTRG_SW20                    EXINT_SWTRG_SWT20
#define EXINT_SWTRG_SW21                    EXINT_SWTRG_SWT21
#define EXINT_SWTRG_SW22                    EXINT_SWTRG_SWT22

/*****************  Bit definition for EXINT_INTSTS register  *****************/
#define EXINT_INTSTS_LINE0_Pos              (0U)
#define EXINT_INTSTS_LINE0_Msk              (0x1U << EXINT_INTSTS_LINE0_Pos)        /*!< 0x00000001 */
#define EXINT_INTSTS_LINE0                  EXINT_INTSTS_LINE0_Msk                  /*!< Status bit for line 0 */
#define EXINT_INTSTS_LINE1_Pos              (1U)
#define EXINT_INTSTS_LINE1_Msk              (0x1U << EXINT_INTSTS_LINE1_Pos)        /*!< 0x00000002 */
#define EXINT_INTSTS_LINE1                  EXINT_INTSTS_LINE1_Msk                  /*!< Status bit for line 1 */
#define EXINT_INTSTS_LINE2_Pos              (2U)
#define EXINT_INTSTS_LINE2_Msk              (0x1U << EXINT_INTSTS_LINE2_Pos)        /*!< 0x00000004 */
#define EXINT_INTSTS_LINE2                  EXINT_INTSTS_LINE2_Msk                  /*!< Status bit for line 2 */
#define EXINT_INTSTS_LINE3_Pos              (3U)
#define EXINT_INTSTS_LINE3_Msk              (0x1U << EXINT_INTSTS_LINE3_Pos)        /*!< 0x00000008 */
#define EXINT_INTSTS_LINE3                  EXINT_INTSTS_LINE3_Msk                  /*!< Status bit for line 3 */
#define EXINT_INTSTS_LINE4_Pos              (4U)
#define EXINT_INTSTS_LINE4_Msk              (0x1U << EXINT_INTSTS_LINE4_Pos)        /*!< 0x00000010 */
#define EXINT_INTSTS_LINE4                  EXINT_INTSTS_LINE4_Msk                  /*!< Status bit for line 4 */
#define EXINT_INTSTS_LINE5_Pos              (5U)
#define EXINT_INTSTS_LINE5_Msk              (0x1U << EXINT_INTSTS_LINE5_Pos)        /*!< 0x00000020 */
#define EXINT_INTSTS_LINE5                  EXINT_INTSTS_LINE5_Msk                  /*!< Status bit for line 5 */
#define EXINT_INTSTS_LINE6_Pos              (6U)
#define EXINT_INTSTS_LINE6_Msk              (0x1U << EXINT_INTSTS_LINE6_Pos)        /*!< 0x00000040 */
#define EXINT_INTSTS_LINE6                  EXINT_INTSTS_LINE6_Msk                  /*!< Status bit for line 6 */
#define EXINT_INTSTS_LINE7_Pos              (7U)
#define EXINT_INTSTS_LINE7_Msk              (0x1U << EXINT_INTSTS_LINE7_Pos)        /*!< 0x00000080 */
#define EXINT_INTSTS_LINE7                  EXINT_INTSTS_LINE7_Msk                  /*!< Status bit for line 7 */
#define EXINT_INTSTS_LINE8_Pos              (8U)
#define EXINT_INTSTS_LINE8_Msk              (0x1U << EXINT_INTSTS_LINE8_Pos)        /*!< 0x00000100 */
#define EXINT_INTSTS_LINE8                  EXINT_INTSTS_LINE8_Msk                  /*!< Status bit for line 8 */
#define EXINT_INTSTS_LINE9_Pos              (9U)
#define EXINT_INTSTS_LINE9_Msk              (0x1U << EXINT_INTSTS_LINE9_Pos)        /*!< 0x00000200 */
#define EXINT_INTSTS_LINE9                  EXINT_INTSTS_LINE9_Msk                  /*!< Status bit for line 9 */
#define EXINT_INTSTS_LINE10_Pos             (10U)
#define EXINT_INTSTS_LINE10_Msk             (0x1U << EXINT_INTSTS_LINE10_Pos)       /*!< 0x00000400 */
#define EXINT_INTSTS_LINE10                 EXINT_INTSTS_LINE10_Msk                 /*!< Status bit for line 10 */
#define EXINT_INTSTS_LINE11_Pos             (11U)
#define EXINT_INTSTS_LINE11_Msk             (0x1U << EXINT_INTSTS_LINE11_Pos)       /*!< 0x00000800 */
#define EXINT_INTSTS_LINE11                 EXINT_INTSTS_LINE11_Msk                 /*!< Status bit for line 11 */
#define EXINT_INTSTS_LINE12_Pos             (12U)
#define EXINT_INTSTS_LINE12_Msk             (0x1U << EXINT_INTSTS_LINE12_Pos)       /*!< 0x00001000 */
#define EXINT_INTSTS_LINE12                 EXINT_INTSTS_LINE12_Msk                 /*!< Status bit for line 12 */
#define EXINT_INTSTS_LINE13_Pos             (13U)
#define EXINT_INTSTS_LINE13_Msk             (0x1U << EXINT_INTSTS_LINE13_Pos)       /*!< 0x00002000 */
#define EXINT_INTSTS_LINE13                 EXINT_INTSTS_LINE13_Msk                 /*!< Status bit for line 13 */
#define EXINT_INTSTS_LINE14_Pos             (14U)
#define EXINT_INTSTS_LINE14_Msk             (0x1U << EXINT_INTSTS_LINE14_Pos)       /*!< 0x00004000 */
#define EXINT_INTSTS_LINE14                 EXINT_INTSTS_LINE14_Msk                 /*!< Status bit for line 14 */
#define EXINT_INTSTS_LINE15_Pos             (15U)
#define EXINT_INTSTS_LINE15_Msk             (0x1U << EXINT_INTSTS_LINE15_Pos)       /*!< 0x00008000 */
#define EXINT_INTSTS_LINE15                 EXINT_INTSTS_LINE15_Msk                 /*!< Status bit for line 15 */
#define EXINT_INTSTS_LINE16_Pos             (16U)
#define EXINT_INTSTS_LINE16_Msk             (0x1U << EXINT_INTSTS_LINE16_Pos)       /*!< 0x00010000 */
#define EXINT_INTSTS_LINE16                 EXINT_INTSTS_LINE16_Msk                 /*!< Status bit for line 16 */
#define EXINT_INTSTS_LINE17_Pos             (17U)
#define EXINT_INTSTS_LINE17_Msk             (0x1U << EXINT_INTSTS_LINE17_Pos)       /*!< 0x00020000 */
#define EXINT_INTSTS_LINE17                 EXINT_INTSTS_LINE17_Msk                 /*!< Status bit for line 17 */
#define EXINT_INTSTS_LINE18_Pos             (18U)
#define EXINT_INTSTS_LINE18_Msk             (0x1U << EXINT_INTSTS_LINE18_Pos)       /*!< 0x00040000 */
#define EXINT_INTSTS_LINE18                 EXINT_INTSTS_LINE18_Msk                 /*!< Status bit for line 18 */
#define EXINT_INTSTS_LINE19_Pos             (19U)
#define EXINT_INTSTS_LINE19_Msk             (0x1U << EXINT_INTSTS_LINE19_Pos)       /*!< 0x00080000 */
#define EXINT_INTSTS_LINE19                 EXINT_INTSTS_LINE19_Msk                 /*!< Status bit for line 19 */
#define EXINT_INTSTS_LINE20_Pos             (20U)
#define EXINT_INTSTS_LINE20_Msk             (0x1U << EXINT_INTSTS_LINE20_Pos)       /*!< 0x00100000 */
#define EXINT_INTSTS_LINE20                 EXINT_INTSTS_LINE20_Msk                 /*!< Status bit for line 20 */
#define EXINT_INTSTS_LINE21_Pos             (21U)
#define EXINT_INTSTS_LINE21_Msk             (0x1U << EXINT_INTSTS_LINE21_Pos)       /*!< 0x00200000 */
#define EXINT_INTSTS_LINE21                 EXINT_INTSTS_LINE21_Msk                 /*!< Status bit for line 21 */
#define EXINT_INTSTS_LINE22_Pos             (22U)
#define EXINT_INTSTS_LINE22_Msk             (0x1U << EXINT_INTSTS_LINE22_Pos)       /*!< 0x00400000 */
#define EXINT_INTSTS_LINE22                 EXINT_INTSTS_LINE22_Msk                 /*!< Status bit for line 22 */

/* References defines */
#define EXINT_INTSTS_INT0                   EXINT_INTSTS_LINE0
#define EXINT_INTSTS_INT1                   EXINT_INTSTS_LINE1
#define EXINT_INTSTS_INT2                   EXINT_INTSTS_LINE2
#define EXINT_INTSTS_INT3                   EXINT_INTSTS_LINE3
#define EXINT_INTSTS_INT4                   EXINT_INTSTS_LINE4
#define EXINT_INTSTS_INT5                   EXINT_INTSTS_LINE5
#define EXINT_INTSTS_INT6                   EXINT_INTSTS_LINE6
#define EXINT_INTSTS_INT7                   EXINT_INTSTS_LINE7
#define EXINT_INTSTS_INT8                   EXINT_INTSTS_LINE8
#define EXINT_INTSTS_INT9                   EXINT_INTSTS_LINE9
#define EXINT_INTSTS_INT10                  EXINT_INTSTS_LINE10
#define EXINT_INTSTS_INT11                  EXINT_INTSTS_LINE11
#define EXINT_INTSTS_INT12                  EXINT_INTSTS_LINE12
#define EXINT_INTSTS_INT13                  EXINT_INTSTS_LINE13
#define EXINT_INTSTS_INT14                  EXINT_INTSTS_LINE14
#define EXINT_INTSTS_INT15                  EXINT_INTSTS_LINE15
#define EXINT_INTSTS_INT16                  EXINT_INTSTS_LINE16
#define EXINT_INTSTS_INT17                  EXINT_INTSTS_LINE17
#define EXINT_INTSTS_INT18                  EXINT_INTSTS_LINE18
#define EXINT_INTSTS_INT19                  EXINT_INTSTS_LINE19
#define EXINT_INTSTS_INT20                  EXINT_INTSTS_LINE20
#define EXINT_INTSTS_INT21                  EXINT_INTSTS_LINE21
#define EXINT_INTSTS_INT22                  EXINT_INTSTS_LINE22

