ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415rx.h
/* Legacy defines */
#define ADC_STS_OCCE                        (ADC_STS_OCCC)
#define ADC_STS_PCCE                        (ADC_STS_PCCC)

/******************  Bit definition for ADC_CTRL1 register  *******************/
/*!< VMCSEL configuration */
#define ADC_CTRL1_VMCSEL_Pos                (0U)
#define ADC_CTRL1_VMCSEL_Msk                (0x1FU << ADC_CTRL1_VMCSEL_Pos)         /*!< 0x0000001F */
#define ADC_CTRL1_VMCSEL                    ADC_CTRL1_VMCSEL_Msk                    /*!< VMCSEL[4:0] bits (Voltage monitoring channel select) */
#define ADC_CTRL1_VMCSEL_0                  (0x01U << ADC_CTRL1_VMCSEL_Pos)         /*!< 0x00000001 */
#define ADC_CTRL1_VMCSEL_1                  (0x02U << ADC_CTRL1_VMCSEL_Pos)         /*!< 0x00000002 */
#define ADC_CTRL1_VMCSEL_2                  (0x04U << ADC_CTRL1_VMCSEL_Pos)         /*!< 0x00000004 */
#define ADC_CTRL1_VMCSEL_3                  (0x08U << ADC_CTRL1_VMCSEL_Pos)         /*!< 0x00000008 */
#define ADC_CTRL1_VMCSEL_4                  (0x10U << ADC_CTRL1_VMCSEL_Pos)         /*!< 0x00000010 */

#define ADC_CTRL1_CCCIEN_Pos                (5U)
#define ADC_CTRL1_CCCIEN_Msk                (0x1U << ADC_CTRL1_CCCIEN_Pos)          /*!< 0x00000020 */
#define ADC_CTRL1_CCCIEN                    ADC_CTRL1_CCCIEN_Msk                    /*!< Channel conversion end interrupt enable */
#define ADC_CTRL1_VMORIEN_Pos               (6U)
#define ADC_CTRL1_VMORIEN_Msk               (0x1U << ADC_CTRL1_VMORIEN_Pos)         /*!< 0x00000040 */
#define ADC_CTRL1_VMORIEN                   ADC_CTRL1_VMORIEN_Msk                   /*!< Voltage monitoring out of range interrupt enable */
#define ADC_CTRL1_PCCCIEN_Pos               (7U)
#define ADC_CTRL1_PCCCIEN_Msk               (0x1U << ADC_CTRL1_PCCCIEN_Pos)         /*!< 0x00000080 */
#define ADC_CTRL1_PCCCIEN                   ADC_CTRL1_PCCCIEN_Msk                   /*!< Conversion end interrupt enable on Preempted channels */
#define ADC_CTRL1_SQEN_Pos                  (8U)
#define ADC_CTRL1_SQEN_Msk                  (0x1U << ADC_CTRL1_SQEN_Pos)            /*!< 0x00000100 */
#define ADC_CTRL1_SQEN                      ADC_CTRL1_SQEN_Msk                      /*!< Sequence mode enable */
#define ADC_CTRL1_VMSGEN_Pos                (9U)
#define ADC_CTRL1_VMSGEN_Msk                (0x1U << ADC_CTRL1_VMSGEN_Pos)          /*!< 0x00000200 */
#define ADC_CTRL1_VMSGEN                    ADC_CTRL1_VMSGEN_Msk                    /*!< Voltage monitoring enable on a single channel */
#define ADC_CTRL1_PCAUTOEN_Pos              (10U)
#define ADC_CTRL1_PCAUTOEN_Msk              (0x1U << ADC_CTRL1_PCAUTOEN_Pos)        /*!< 0x00000400 */
#define ADC_CTRL1_PCAUTOEN                  ADC_CTRL1_PCAUTOEN_Msk                  /*!< Preempted group automatic conversion enable after ordinary group */
#define ADC_CTRL1_OCPEN_Pos                 (11U)
#define ADC_CTRL1_OCPEN_Msk                 (0x1U << ADC_CTRL1_OCPEN_Pos)           /*!< 0x00000800 */
#define ADC_CTRL1_OCPEN                     ADC_CTRL1_OCPEN_Msk                     /*!< Partitioned mode enable on ordinary channels */
#define ADC_CTRL1_PCPEN_Pos                 (12U)
#define ADC_CTRL1_PCPEN_Msk                 (0x1U << ADC_CTRL1_PCPEN_Pos)           /*!< 0x00001000 */
#define ADC_CTRL1_PCPEN                     ADC_CTRL1_PCPEN_Msk                     /*!< Partitioned mode enable on preempted channels */

/*!< OCPCNT configuration */
#define ADC_CTRL1_OCPCNT_Pos                (13U)
#define ADC_CTRL1_OCPCNT_Msk                (0x7U << ADC_CTRL1_OCPCNT_Pos)          /*!< 0x0000E000 */
#define ADC_CTRL1_OCPCNT                    ADC_CTRL1_OCPCNT_Msk                    /*!< OCPCNT[2:0] bits (Partitioned mode conversion count of ordinary channels) */
#define ADC_CTRL1_OCPCNT_0                  (0x1U << ADC_CTRL1_OCPCNT_Pos)          /*!< 0x00002000 */
#define ADC_CTRL1_OCPCNT_1                  (0x2U << ADC_CTRL1_OCPCNT_Pos)          /*!< 0x00004000 */
#define ADC_CTRL1_OCPCNT_2                  (0x4U << ADC_CTRL1_OCPCNT_Pos)          /*!< 0x00008000 */

#define ADC_CTRL1_PCVMEN_Pos                (22U)
#define ADC_CTRL1_PCVMEN_Msk                (0x1U << ADC_CTRL1_PCVMEN_Pos)          /*!< 0x00400000 */
#define ADC_CTRL1_PCVMEN                    ADC_CTRL1_PCVMEN_Msk                    /*!< Voltage monitoring enable on preempted channels */
#define ADC_CTRL1_OCVMEN_Pos                (23U)
#define ADC_CTRL1_OCVMEN_Msk                (0x1U << ADC_CTRL1_OCVMEN_Pos)          /*!< 0x00800000 */
#define ADC_CTRL1_OCVMEN                    ADC_CTRL1_OCVMEN_Msk                    /*!< Voltage monitoring enable on ordinary channels */

/* Legacy defines */
#define ADC_CTRL1_CCEIEN                    (ADC_CTRL1_CCCIEN)
#define ADC_CTRL1_PCCEIEN                   (ADC_CTRL1_PCCCIEN)

/******************  Bit definition for ADC_CTRL2 register  *******************/
#define ADC_CTRL2_ADCEN_Pos                 (0U)
#define ADC_CTRL2_ADCEN_Msk                 (0x1U << ADC_CTRL2_ADCEN_Pos)           /*!< 0x00000001 */
#define ADC_CTRL2_ADCEN                     ADC_CTRL2_ADCEN_Msk                     /*!< A/D converter enable */
#define ADC_CTRL2_RPEN_Pos                  (1U)
#define ADC_CTRL2_RPEN_Msk                  (0x1U << ADC_CTRL2_RPEN_Pos)            /*!< 0x00000002 */
#define ADC_CTRL2_RPEN                      ADC_CTRL2_RPEN_Msk                      /*!< Repetition mode enable */
#define ADC_CTRL2_ADCAL_Pos                 (2U)
#define ADC_CTRL2_ADCAL_Msk                 (0x1U << ADC_CTRL2_ADCAL_Pos)           /*!< 0x00000004 */
#define ADC_CTRL2_ADCAL                     ADC_CTRL2_ADCAL_Msk                     /*!< A/D calibration */
#define ADC_CTRL2_ADCALINIT_Pos             (3U)
#define ADC_CTRL2_ADCALINIT_Msk             (0x1U << ADC_CTRL2_ADCALINIT_Pos)       /*!< 0x00000008 */
#define ADC_CTRL2_ADCALINIT                 ADC_CTRL2_ADCALINIT_Msk                 /*!< Initialize A/D calibration */
#define ADC_CTRL2_OCDMAEN_Pos               (8U)
#define ADC_CTRL2_OCDMAEN_Msk               (0x1U << ADC_CTRL2_OCDMAEN_Pos)         /*!< 0x00000100 */
#define ADC_CTRL2_OCDMAEN                   ADC_CTRL2_OCDMAEN_Msk                   /*!< DMA transfer enable of ordinary channels */
#define ADC_CTRL2_DTALIGN_Pos               (11U)
#define ADC_CTRL2_DTALIGN_Msk               (0x1U << ADC_CTRL2_DTALIGN_Pos)         /*!< 0x00000800 */
#define ADC_CTRL2_DTALIGN                   ADC_CTRL2_DTALIGN_Msk                   /*!< Data alignment */

/*!< PCTESEL configuration */
#define ADC_CTRL2_PCTESEL_Msk               ((0x7U << 12) | (0x1U << 24))           /*!< 0x01007000 */
#define ADC_CTRL2_PCTESEL                   ADC_CTRL2_PCTESEL_Msk                   /*!< PCTESEL[3:0] bits (Trigger event select for preempted channels conversion) */
#define ADC_CTRL2_PCTESEL_0                 (0x1U << 12)                            /*!< 0x00001000 */
#define ADC_CTRL2_PCTESEL_1                 (0x2U << 12)                            /*!< 0x00002000 */
#define ADC_CTRL2_PCTESEL_2                 (0x4U << 12)                            /*!< 0x00004000 */
#define ADC_CTRL2_PCTESEL_3                 (0x1U << 24)                            /*!< 0x01000000 */

#define ADC_CTRL2_PCTEN_Pos                 (15U)
#define ADC_CTRL2_PCTEN_Msk                 (0x1U << ADC_CTRL2_PCTEN_Pos)           /*!< 0x00008000 */
#define ADC_CTRL2_PCTEN                     ADC_CTRL2_PCTEN_Msk                     /*!< Trigger mode enable for preempted channels conversion */

/*!< OCTESEL configuration */
#define ADC_CTRL2_OCTESEL_Msk               ((0x7U << 17) | (0x1U << 25))           /*!< 0x020E0000 */
#define ADC_CTRL2_OCTESEL                   ADC_CTRL2_OCTESEL_Msk                   /*!< OCTESEL[3:0] bits (Trigger event select for ordinary channels conversion) */
#define ADC_CTRL2_OCTESEL_0                 (0x1U << 17)                            /*!< 0x00020000 */
#define ADC_CTRL2_OCTESEL_1                 (0x2U << 17)                            /*!< 0x00040000 */
#define ADC_CTRL2_OCTESEL_2                 (0x4U << 17)                            /*!< 0x00080000 */
#define ADC_CTRL2_OCTESEL_3                 (0x1U << 25)                            /*!< 0x02000000 */

#define ADC_CTRL2_OCTEN_Pos                 (20U)
#define ADC_CTRL2_OCTEN_Msk                 (0x1U << ADC_CTRL2_OCTEN_Pos)           /*!< 0x00100000 */
#define ADC_CTRL2_OCTEN                     ADC_CTRL2_OCTEN_Msk                     /*!< Trigger mode enable for ordinary channels conversion */
#define ADC_CTRL2_PCSWTRG_Pos               (21U)
#define ADC_CTRL2_PCSWTRG_Msk               (0x1U << ADC_CTRL2_PCSWTRG_Pos)         /*!< 0x00200000 */
#define ADC_CTRL2_PCSWTRG                   ADC_CTRL2_PCSWTRG_Msk                   /*!< Conversion of preempted channels triggered by software */
#define ADC_CTRL2_OCSWTRG_Pos               (22U)
#define ADC_CTRL2_OCSWTRG_Msk               (0x1U << ADC_CTRL2_OCSWTRG_Pos)         /*!< 0x00400000 */
#define ADC_CTRL2_OCSWTRG                   ADC_CTRL2_OCSWTRG_Msk                   /*!< Conversion of ordinary channels triggered by software */
#define ADC_CTRL2_ITSRVEN_Pos               (23U)
#define ADC_CTRL2_ITSRVEN_Msk               (0x1U << ADC_CTRL2_ITSRVEN_Pos)         /*!< 0x00800000 */
#define ADC_CTRL2_ITSRVEN                   ADC_CTRL2_ITSRVEN_Msk                   /*!< Internal temperature sensor and VINTRV enable */

/*******************  Bit definition for ADC_SPT1 register  *******************/
/*!< CSPT10 configuration */
#define ADC_SPT1_CSPT10_Pos                 (0U)
#define ADC_SPT1_CSPT10_Msk                 (0x7U << ADC_SPT1_CSPT10_Pos)           /*!< 0x00000007 */
#define ADC_SPT1_CSPT10                     ADC_SPT1_CSPT10_Msk                     /*!< CSPT10[2:0] bits (Sample time selection of channel ADC_IN10) */
#define ADC_SPT1_CSPT10_0                   (0x1U << ADC_SPT1_CSPT10_Pos)           /*!< 0x00000001 */
#define ADC_SPT1_CSPT10_1                   (0x2U << ADC_SPT1_CSPT10_Pos)           /*!< 0x00000002 */
#define ADC_SPT1_CSPT10_2                   (0x4U << ADC_SPT1_CSPT10_Pos)           /*!< 0x00000004 */

/*!< CSPT11 configuration */
#define ADC_SPT1_CSPT11_Pos                 (3U)
#define ADC_SPT1_CSPT11_Msk                 (0x7U << ADC_SPT1_CSPT11_Pos)           /*!< 0x00000038 */
#define ADC_SPT1_CSPT11                     ADC_SPT1_CSPT11_Msk                     /*!< CSPT11[2:0] bits (Sample time selection of channel ADC_IN11) */
#define ADC_SPT1_CSPT11_0                   (0x1U << ADC_SPT1_CSPT11_Pos)           /*!< 0x00000008 */
#define ADC_SPT1_CSPT11_1                   (0x2U << ADC_SPT1_CSPT11_Pos)           /*!< 0x00000010 */
#define ADC_SPT1_CSPT11_2                   (0x4U << ADC_SPT1_CSPT11_Pos)           /*!< 0x00000020 */

/*!< CSPT12 configuration */
#define ADC_SPT1_CSPT12_Pos                 (6U)
#define ADC_SPT1_CSPT12_Msk                 (0x7U << ADC_SPT1_CSPT12_Pos)           /*!< 0x000001C0 */
#define ADC_SPT1_CSPT12                     ADC_SPT1_CSPT12_Msk                     /*!< CSPT12[2:0] bits (Sample time selection of channel ADC_IN12) */
#define ADC_SPT1_CSPT12_0                   (0x1U << ADC_SPT1_CSPT12_Pos)           /*!< 0x00000040 */
#define ADC_SPT1_CSPT12_1                   (0x2U << ADC_SPT1_CSPT12_Pos)           /*!< 0x00000080 */
#define ADC_SPT1_CSPT12_2                   (0x4U << ADC_SPT1_CSPT12_Pos)           /*!< 0x00000100 */

/*!< CSPT13 configuration */
#define ADC_SPT1_CSPT13_Pos                 (9U)
#define ADC_SPT1_CSPT13_Msk                 (0x7U << ADC_SPT1_CSPT13_Pos)           /*!< 0x00000E00 */
#define ADC_SPT1_CSPT13                     ADC_SPT1_CSPT13_Msk                     /*!< CSPT13[2:0] bits (Sample time selection of channel ADC_IN13) */
#define ADC_SPT1_CSPT13_0                   (0x1U << ADC_SPT1_CSPT13_Pos)           /*!< 0x00000200 */
#define ADC_SPT1_CSPT13_1                   (0x2U << ADC_SPT1_CSPT13_Pos)           /*!< 0x00000400 */
#define ADC_SPT1_CSPT13_2                   (0x4U << ADC_SPT1_CSPT13_Pos)           /*!< 0x00000800 */

/*!< CSPT14 configuration */
#define ADC_SPT1_CSPT14_Pos                 (12U)
#define ADC_SPT1_CSPT14_Msk                 (0x7U << ADC_SPT1_CSPT14_Pos)           /*!< 0x00007000 */
#define ADC_SPT1_CSPT14                     ADC_SPT1_CSPT14_Msk                     /*!< CSPT14[2:0] bits (Sample time selection of channel ADC_IN14) */
#define ADC_SPT1_CSPT14_0                   (0x1U << ADC_SPT1_CSPT14_Pos)           /*!< 0x00001000 */
#define ADC_SPT1_CSPT14_1                   (0x2U << ADC_SPT1_CSPT14_Pos)           /*!< 0x00002000 */
#define ADC_SPT1_CSPT14_2                   (0x4U << ADC_SPT1_CSPT14_Pos)           /*!< 0x00004000 */

/*!< CSPT15 configuration */
#define ADC_SPT1_CSPT15_Pos                 (15U)
#define ADC_SPT1_CSPT15_Msk                 (0x7U << ADC_SPT1_CSPT15_Pos)           /*!< 0x00038000 */
#define ADC_SPT1_CSPT15                     ADC_SPT1_CSPT15_Msk                     /*!< CSPT15[2:0] bits (Sample time selection of channel ADC_IN15) */
#define ADC_SPT1_CSPT15_0                   (0x1U << ADC_SPT1_CSPT15_Pos)           /*!< 0x00008000 */
#define ADC_SPT1_CSPT15_1                   (0x2U << ADC_SPT1_CSPT15_Pos)           /*!< 0x00010000 */
#define ADC_SPT1_CSPT15_2                   (0x4U << ADC_SPT1_CSPT15_Pos)           /*!< 0x00020000 */

/*!< CSPT16 configuration */
#define ADC_SPT1_CSPT16_Pos                 (18U)
#define ADC_SPT1_CSPT16_Msk                 (0x7U << ADC_SPT1_CSPT16_Pos)           /*!< 0x001C0000 */
#define ADC_SPT1_CSPT16                     ADC_SPT1_CSPT16_Msk                     /*!< CSPT16[2:0] bits (Sample time selection of channel ADC_IN16) */
#define ADC_SPT1_CSPT16_0                   (0x1U << ADC_SPT1_CSPT16_Pos)           /*!< 0x00040000 */
#define ADC_SPT1_CSPT16_1                   (0x2U << ADC_SPT1_CSPT16_Pos)           /*!< 0x00080000 */
#define ADC_SPT1_CSPT16_2                   (0x4U << ADC_SPT1_CSPT16_Pos)           /*!< 0x00100000 */

