ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415rx.h
/******************  Bit definition for CAN_F10FB1 register  ******************/
#define CAN_F10FB1_FFDB0_Pos                (0U)
#define CAN_F10FB1_FFDB0_Msk                (0x1U << CAN_F10FB1_FFDB0_Pos)          /*!< 0x00000001 */
#define CAN_F10FB1_FFDB0                    CAN_F10FB1_FFDB0_Msk                    /*!< Filter data bit 0 */
#define CAN_F10FB1_FFDB1_Pos                (1U)
#define CAN_F10FB1_FFDB1_Msk                (0x1U << CAN_F10FB1_FFDB1_Pos)          /*!< 0x00000002 */
#define CAN_F10FB1_FFDB1                    CAN_F10FB1_FFDB1_Msk                    /*!< Filter data bit 1 */
#define CAN_F10FB1_FFDB2_Pos                (2U)
#define CAN_F10FB1_FFDB2_Msk                (0x1U << CAN_F10FB1_FFDB2_Pos)          /*!< 0x00000004 */
#define CAN_F10FB1_FFDB2                    CAN_F10FB1_FFDB2_Msk                    /*!< Filter data bit 2 */
#define CAN_F10FB1_FFDB3_Pos                (3U)
#define CAN_F10FB1_FFDB3_Msk                (0x1U << CAN_F10FB1_FFDB3_Pos)          /*!< 0x00000008 */
#define CAN_F10FB1_FFDB3                    CAN_F10FB1_FFDB3_Msk                    /*!< Filter data bit 3 */
#define CAN_F10FB1_FFDB4_Pos                (4U)
#define CAN_F10FB1_FFDB4_Msk                (0x1U << CAN_F10FB1_FFDB4_Pos)          /*!< 0x00000010 */
#define CAN_F10FB1_FFDB4                    CAN_F10FB1_FFDB4_Msk                    /*!< Filter data bit 4 */
#define CAN_F10FB1_FFDB5_Pos                (5U)
#define CAN_F10FB1_FFDB5_Msk                (0x1U << CAN_F10FB1_FFDB5_Pos)          /*!< 0x00000020 */
#define CAN_F10FB1_FFDB5                    CAN_F10FB1_FFDB5_Msk                    /*!< Filter data bit 5 */
#define CAN_F10FB1_FFDB6_Pos                (6U)
#define CAN_F10FB1_FFDB6_Msk                (0x1U << CAN_F10FB1_FFDB6_Pos)          /*!< 0x00000040 */
#define CAN_F10FB1_FFDB6                    CAN_F10FB1_FFDB6_Msk                    /*!< Filter data bit 6 */
#define CAN_F10FB1_FFDB7_Pos                (7U)
#define CAN_F10FB1_FFDB7_Msk                (0x1U << CAN_F10FB1_FFDB7_Pos)          /*!< 0x00000080 */
#define CAN_F10FB1_FFDB7                    CAN_F10FB1_FFDB7_Msk                    /*!< Filter data bit 7 */
#define CAN_F10FB1_FFDB8_Pos                (8U)
#define CAN_F10FB1_FFDB8_Msk                (0x1U << CAN_F10FB1_FFDB8_Pos)          /*!< 0x00000100 */
#define CAN_F10FB1_FFDB8                    CAN_F10FB1_FFDB8_Msk                    /*!< Filter data bit 8 */
#define CAN_F10FB1_FFDB9_Pos                (9U)
#define CAN_F10FB1_FFDB9_Msk                (0x1U << CAN_F10FB1_FFDB9_Pos)          /*!< 0x00000200 */
#define CAN_F10FB1_FFDB9                    CAN_F10FB1_FFDB9_Msk                    /*!< Filter data bit 9 */
#define CAN_F10FB1_FFDB10_Pos               (10U)
#define CAN_F10FB1_FFDB10_Msk               (0x1U << CAN_F10FB1_FFDB10_Pos)         /*!< 0x00000400 */
#define CAN_F10FB1_FFDB10                   CAN_F10FB1_FFDB10_Msk                   /*!< Filter data bit 10 */
#define CAN_F10FB1_FFDB11_Pos               (11U)
#define CAN_F10FB1_FFDB11_Msk               (0x1U << CAN_F10FB1_FFDB11_Pos)         /*!< 0x00000800 */
#define CAN_F10FB1_FFDB11                   CAN_F10FB1_FFDB11_Msk                   /*!< Filter data bit 11 */
#define CAN_F10FB1_FFDB12_Pos               (12U)
#define CAN_F10FB1_FFDB12_Msk               (0x1U << CAN_F10FB1_FFDB12_Pos)         /*!< 0x00001000 */
#define CAN_F10FB1_FFDB12                   CAN_F10FB1_FFDB12_Msk                   /*!< Filter data bit 12 */
#define CAN_F10FB1_FFDB13_Pos               (13U)
#define CAN_F10FB1_FFDB13_Msk               (0x1U << CAN_F10FB1_FFDB13_Pos)         /*!< 0x00002000 */
#define CAN_F10FB1_FFDB13                   CAN_F10FB1_FFDB13_Msk                   /*!< Filter data bit 13 */
#define CAN_F10FB1_FFDB14_Pos               (14U)
#define CAN_F10FB1_FFDB14_Msk               (0x1U << CAN_F10FB1_FFDB14_Pos)         /*!< 0x00004000 */
#define CAN_F10FB1_FFDB14                   CAN_F10FB1_FFDB14_Msk                   /*!< Filter data bit 14 */
#define CAN_F10FB1_FFDB15_Pos               (15U)
#define CAN_F10FB1_FFDB15_Msk               (0x1U << CAN_F10FB1_FFDB15_Pos)         /*!< 0x00008000 */
#define CAN_F10FB1_FFDB15                   CAN_F10FB1_FFDB15_Msk                   /*!< Filter data bit 15 */
#define CAN_F10FB1_FFDB16_Pos               (16U)
#define CAN_F10FB1_FFDB16_Msk               (0x1U << CAN_F10FB1_FFDB16_Pos)         /*!< 0x00010000 */
#define CAN_F10FB1_FFDB16                   CAN_F10FB1_FFDB16_Msk                   /*!< Filter data bit 16 */
#define CAN_F10FB1_FFDB17_Pos               (17U)
#define CAN_F10FB1_FFDB17_Msk               (0x1U << CAN_F10FB1_FFDB17_Pos)         /*!< 0x00020000 */
#define CAN_F10FB1_FFDB17                   CAN_F10FB1_FFDB17_Msk                   /*!< Filter data bit 17 */
#define CAN_F10FB1_FFDB18_Pos               (18U)
#define CAN_F10FB1_FFDB18_Msk               (0x1U << CAN_F10FB1_FFDB18_Pos)         /*!< 0x00040000 */
#define CAN_F10FB1_FFDB18                   CAN_F10FB1_FFDB18_Msk                   /*!< Filter data bit 18 */
#define CAN_F10FB1_FFDB19_Pos               (19U)
#define CAN_F10FB1_FFDB19_Msk               (0x1U << CAN_F10FB1_FFDB19_Pos)         /*!< 0x00080000 */
#define CAN_F10FB1_FFDB19                   CAN_F10FB1_FFDB19_Msk                   /*!< Filter data bit 19 */
#define CAN_F10FB1_FFDB20_Pos               (20U)
#define CAN_F10FB1_FFDB20_Msk               (0x1U << CAN_F10FB1_FFDB20_Pos)         /*!< 0x00100000 */
#define CAN_F10FB1_FFDB20                   CAN_F10FB1_FFDB20_Msk                   /*!< Filter data bit 20 */
#define CAN_F10FB1_FFDB21_Pos               (21U)
#define CAN_F10FB1_FFDB21_Msk               (0x1U << CAN_F10FB1_FFDB21_Pos)         /*!< 0x00200000 */
#define CAN_F10FB1_FFDB21                   CAN_F10FB1_FFDB21_Msk                   /*!< Filter data bit 21 */
#define CAN_F10FB1_FFDB22_Pos               (22U)
#define CAN_F10FB1_FFDB22_Msk               (0x1U << CAN_F10FB1_FFDB22_Pos)         /*!< 0x00400000 */
#define CAN_F10FB1_FFDB22                   CAN_F10FB1_FFDB22_Msk                   /*!< Filter data bit 22 */
#define CAN_F10FB1_FFDB23_Pos               (23U)
#define CAN_F10FB1_FFDB23_Msk               (0x1U << CAN_F10FB1_FFDB23_Pos)         /*!< 0x00800000 */
#define CAN_F10FB1_FFDB23                   CAN_F10FB1_FFDB23_Msk                   /*!< Filter data bit 23 */
#define CAN_F10FB1_FFDB24_Pos               (24U)
#define CAN_F10FB1_FFDB24_Msk               (0x1U << CAN_F10FB1_FFDB24_Pos)         /*!< 0x01000000 */
#define CAN_F10FB1_FFDB24                   CAN_F10FB1_FFDB24_Msk                   /*!< Filter data bit 24 */
#define CAN_F10FB1_FFDB25_Pos               (25U)
#define CAN_F10FB1_FFDB25_Msk               (0x1U << CAN_F10FB1_FFDB25_Pos)         /*!< 0x02000000 */
#define CAN_F10FB1_FFDB25                   CAN_F10FB1_FFDB25_Msk                   /*!< Filter data bit 25 */
#define CAN_F10FB1_FFDB26_Pos               (26U)
#define CAN_F10FB1_FFDB26_Msk               (0x1U << CAN_F10FB1_FFDB26_Pos)         /*!< 0x04000000 */
#define CAN_F10FB1_FFDB26                   CAN_F10FB1_FFDB26_Msk                   /*!< Filter data bit 26 */
#define CAN_F10FB1_FFDB27_Pos               (27U)
#define CAN_F10FB1_FFDB27_Msk               (0x1U << CAN_F10FB1_FFDB27_Pos)         /*!< 0x08000000 */
#define CAN_F10FB1_FFDB27                   CAN_F10FB1_FFDB27_Msk                   /*!< Filter data bit 27 */
#define CAN_F10FB1_FFDB28_Pos               (28U)
#define CAN_F10FB1_FFDB28_Msk               (0x1U << CAN_F10FB1_FFDB28_Pos)         /*!< 0x10000000 */
#define CAN_F10FB1_FFDB28                   CAN_F10FB1_FFDB28_Msk                   /*!< Filter data bit 28 */
#define CAN_F10FB1_FFDB29_Pos               (29U)
#define CAN_F10FB1_FFDB29_Msk               (0x1U << CAN_F10FB1_FFDB29_Pos)         /*!< 0x20000000 */
#define CAN_F10FB1_FFDB29                   CAN_F10FB1_FFDB29_Msk                   /*!< Filter data bit 29 */
#define CAN_F10FB1_FFDB30_Pos               (30U)
#define CAN_F10FB1_FFDB30_Msk               (0x1U << CAN_F10FB1_FFDB30_Pos)         /*!< 0x40000000 */
#define CAN_F10FB1_FFDB30                   CAN_F10FB1_FFDB30_Msk                   /*!< Filter data bit 30 */
#define CAN_F10FB1_FFDB31_Pos               (31U)
#define CAN_F10FB1_FFDB31_Msk               (0x1U << CAN_F10FB1_FFDB31_Pos)         /*!< 0x80000000 */
#define CAN_F10FB1_FFDB31                   CAN_F10FB1_FFDB31_Msk                   /*!< Filter data bit 31 */

/******************  Bit definition for CAN_F11FB1 register  ******************/
#define CAN_F11FB1_FFDB0_Pos                (0U)
#define CAN_F11FB1_FFDB0_Msk                (0x1U << CAN_F11FB1_FFDB0_Pos)          /*!< 0x00000001 */
#define CAN_F11FB1_FFDB0                    CAN_F11FB1_FFDB0_Msk                    /*!< Filter data bit 0 */
#define CAN_F11FB1_FFDB1_Pos                (1U)
#define CAN_F11FB1_FFDB1_Msk                (0x1U << CAN_F11FB1_FFDB1_Pos)          /*!< 0x00000002 */
#define CAN_F11FB1_FFDB1                    CAN_F11FB1_FFDB1_Msk                    /*!< Filter data bit 1 */
#define CAN_F11FB1_FFDB2_Pos                (2U)
#define CAN_F11FB1_FFDB2_Msk                (0x1U << CAN_F11FB1_FFDB2_Pos)          /*!< 0x00000004 */
#define CAN_F11FB1_FFDB2                    CAN_F11FB1_FFDB2_Msk                    /*!< Filter data bit 2 */
#define CAN_F11FB1_FFDB3_Pos                (3U)
#define CAN_F11FB1_FFDB3_Msk                (0x1U << CAN_F11FB1_FFDB3_Pos)          /*!< 0x00000008 */
#define CAN_F11FB1_FFDB3                    CAN_F11FB1_FFDB3_Msk                    /*!< Filter data bit 3 */
#define CAN_F11FB1_FFDB4_Pos                (4U)
#define CAN_F11FB1_FFDB4_Msk                (0x1U << CAN_F11FB1_FFDB4_Pos)          /*!< 0x00000010 */
#define CAN_F11FB1_FFDB4                    CAN_F11FB1_FFDB4_Msk                    /*!< Filter data bit 4 */
#define CAN_F11FB1_FFDB5_Pos                (5U)
#define CAN_F11FB1_FFDB5_Msk                (0x1U << CAN_F11FB1_FFDB5_Pos)          /*!< 0x00000020 */
#define CAN_F11FB1_FFDB5                    CAN_F11FB1_FFDB5_Msk                    /*!< Filter data bit 5 */
#define CAN_F11FB1_FFDB6_Pos                (6U)
#define CAN_F11FB1_FFDB6_Msk                (0x1U << CAN_F11FB1_FFDB6_Pos)          /*!< 0x00000040 */
#define CAN_F11FB1_FFDB6                    CAN_F11FB1_FFDB6_Msk                    /*!< Filter data bit 6 */
#define CAN_F11FB1_FFDB7_Pos                (7U)
#define CAN_F11FB1_FFDB7_Msk                (0x1U << CAN_F11FB1_FFDB7_Pos)          /*!< 0x00000080 */
#define CAN_F11FB1_FFDB7                    CAN_F11FB1_FFDB7_Msk                    /*!< Filter data bit 7 */
#define CAN_F11FB1_FFDB8_Pos                (8U)
#define CAN_F11FB1_FFDB8_Msk                (0x1U << CAN_F11FB1_FFDB8_Pos)          /*!< 0x00000100 */
#define CAN_F11FB1_FFDB8                    CAN_F11FB1_FFDB8_Msk                    /*!< Filter data bit 8 */
#define CAN_F11FB1_FFDB9_Pos                (9U)
#define CAN_F11FB1_FFDB9_Msk                (0x1U << CAN_F11FB1_FFDB9_Pos)          /*!< 0x00000200 */
#define CAN_F11FB1_FFDB9                    CAN_F11FB1_FFDB9_Msk                    /*!< Filter data bit 9 */
#define CAN_F11FB1_FFDB10_Pos               (10U)
#define CAN_F11FB1_FFDB10_Msk               (0x1U << CAN_F11FB1_FFDB10_Pos)         /*!< 0x00000400 */
#define CAN_F11FB1_FFDB10                   CAN_F11FB1_FFDB10_Msk                   /*!< Filter data bit 10 */
#define CAN_F11FB1_FFDB11_Pos               (11U)
#define CAN_F11FB1_FFDB11_Msk               (0x1U << CAN_F11FB1_FFDB11_Pos)         /*!< 0x00000800 */
#define CAN_F11FB1_FFDB11                   CAN_F11FB1_FFDB11_Msk                   /*!< Filter data bit 11 */
#define CAN_F11FB1_FFDB12_Pos               (12U)
#define CAN_F11FB1_FFDB12_Msk               (0x1U << CAN_F11FB1_FFDB12_Pos)         /*!< 0x00001000 */
#define CAN_F11FB1_FFDB12                   CAN_F11FB1_FFDB12_Msk                   /*!< Filter data bit 12 */
#define CAN_F11FB1_FFDB13_Pos               (13U)
#define CAN_F11FB1_FFDB13_Msk               (0x1U << CAN_F11FB1_FFDB13_Pos)         /*!< 0x00002000 */
#define CAN_F11FB1_FFDB13                   CAN_F11FB1_FFDB13_Msk                   /*!< Filter data bit 13 */
#define CAN_F11FB1_FFDB14_Pos               (14U)
#define CAN_F11FB1_FFDB14_Msk               (0x1U << CAN_F11FB1_FFDB14_Pos)         /*!< 0x00004000 */
#define CAN_F11FB1_FFDB14                   CAN_F11FB1_FFDB14_Msk                   /*!< Filter data bit 14 */
#define CAN_F11FB1_FFDB15_Pos               (15U)
#define CAN_F11FB1_FFDB15_Msk               (0x1U << CAN_F11FB1_FFDB15_Pos)         /*!< 0x00008000 */
#define CAN_F11FB1_FFDB15                   CAN_F11FB1_FFDB15_Msk                   /*!< Filter data bit 15 */
#define CAN_F11FB1_FFDB16_Pos               (16U)
#define CAN_F11FB1_FFDB16_Msk               (0x1U << CAN_F11FB1_FFDB16_Pos)         /*!< 0x00010000 */
#define CAN_F11FB1_FFDB16                   CAN_F11FB1_FFDB16_Msk                   /*!< Filter data bit 16 */
#define CAN_F11FB1_FFDB17_Pos               (17U)
#define CAN_F11FB1_FFDB17_Msk               (0x1U << CAN_F11FB1_FFDB17_Pos)         /*!< 0x00020000 */
#define CAN_F11FB1_FFDB17                   CAN_F11FB1_FFDB17_Msk                   /*!< Filter data bit 17 */
#define CAN_F11FB1_FFDB18_Pos               (18U)
#define CAN_F11FB1_FFDB18_Msk               (0x1U << CAN_F11FB1_FFDB18_Pos)         /*!< 0x00040000 */
#define CAN_F11FB1_FFDB18                   CAN_F11FB1_FFDB18_Msk                   /*!< Filter data bit 18 */
#define CAN_F11FB1_FFDB19_Pos               (19U)
#define CAN_F11FB1_FFDB19_Msk               (0x1U << CAN_F11FB1_FFDB19_Pos)         /*!< 0x00080000 */
#define CAN_F11FB1_FFDB19                   CAN_F11FB1_FFDB19_Msk                   /*!< Filter data bit 19 */
#define CAN_F11FB1_FFDB20_Pos               (20U)
#define CAN_F11FB1_FFDB20_Msk               (0x1U << CAN_F11FB1_FFDB20_Pos)         /*!< 0x00100000 */
#define CAN_F11FB1_FFDB20                   CAN_F11FB1_FFDB20_Msk                   /*!< Filter data bit 20 */
#define CAN_F11FB1_FFDB21_Pos               (21U)
#define CAN_F11FB1_FFDB21_Msk               (0x1U << CAN_F11FB1_FFDB21_Pos)         /*!< 0x00200000 */
#define CAN_F11FB1_FFDB21                   CAN_F11FB1_FFDB21_Msk                   /*!< Filter data bit 21 */
#define CAN_F11FB1_FFDB22_Pos               (22U)
#define CAN_F11FB1_FFDB22_Msk               (0x1U << CAN_F11FB1_FFDB22_Pos)         /*!< 0x00400000 */
#define CAN_F11FB1_FFDB22                   CAN_F11FB1_FFDB22_Msk                   /*!< Filter data bit 22 */
#define CAN_F11FB1_FFDB23_Pos               (23U)
#define CAN_F11FB1_FFDB23_Msk               (0x1U << CAN_F11FB1_FFDB23_Pos)         /*!< 0x00800000 */
#define CAN_F11FB1_FFDB23                   CAN_F11FB1_FFDB23_Msk                   /*!< Filter data bit 23 */
#define CAN_F11FB1_FFDB24_Pos               (24U)
#define CAN_F11FB1_FFDB24_Msk               (0x1U << CAN_F11FB1_FFDB24_Pos)         /*!< 0x01000000 */
#define CAN_F11FB1_FFDB24                   CAN_F11FB1_FFDB24_Msk                   /*!< Filter data bit 24 */
#define CAN_F11FB1_FFDB25_Pos               (25U)
#define CAN_F11FB1_FFDB25_Msk               (0x1U << CAN_F11FB1_FFDB25_Pos)         /*!< 0x02000000 */
#define CAN_F11FB1_FFDB25                   CAN_F11FB1_FFDB25_Msk                   /*!< Filter data bit 25 */
#define CAN_F11FB1_FFDB26_Pos               (26U)
#define CAN_F11FB1_FFDB26_Msk               (0x1U << CAN_F11FB1_FFDB26_Pos)         /*!< 0x04000000 */
#define CAN_F11FB1_FFDB26                   CAN_F11FB1_FFDB26_Msk                   /*!< Filter data bit 26 */
#define CAN_F11FB1_FFDB27_Pos               (27U)
#define CAN_F11FB1_FFDB27_Msk               (0x1U << CAN_F11FB1_FFDB27_Pos)         /*!< 0x08000000 */
#define CAN_F11FB1_FFDB27                   CAN_F11FB1_FFDB27_Msk                   /*!< Filter data bit 27 */
#define CAN_F11FB1_FFDB28_Pos               (28U)
#define CAN_F11FB1_FFDB28_Msk               (0x1U << CAN_F11FB1_FFDB28_Pos)         /*!< 0x10000000 */
#define CAN_F11FB1_FFDB28                   CAN_F11FB1_FFDB28_Msk                   /*!< Filter data bit 28 */
#define CAN_F11FB1_FFDB29_Pos               (29U)
#define CAN_F11FB1_FFDB29_Msk               (0x1U << CAN_F11FB1_FFDB29_Pos)         /*!< 0x20000000 */
#define CAN_F11FB1_FFDB29                   CAN_F11FB1_FFDB29_Msk                   /*!< Filter data bit 29 */
#define CAN_F11FB1_FFDB30_Pos               (30U)
#define CAN_F11FB1_FFDB30_Msk               (0x1U << CAN_F11FB1_FFDB30_Pos)         /*!< 0x40000000 */
#define CAN_F11FB1_FFDB30                   CAN_F11FB1_FFDB30_Msk                   /*!< Filter data bit 30 */
#define CAN_F11FB1_FFDB31_Pos               (31U)
#define CAN_F11FB1_FFDB31_Msk               (0x1U << CAN_F11FB1_FFDB31_Pos)         /*!< 0x80000000 */
#define CAN_F11FB1_FFDB31                   CAN_F11FB1_FFDB31_Msk                   /*!< Filter data bit 31 */

