ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415rx.h
/*****************  Bit definition for CMP_CTRLSTS1 register  *****************/
#define CMP_CTRLSTS1_CMP1EN_Pos             (0U)
#define CMP_CTRLSTS1_CMP1EN_Msk             (0x1U << CMP_CTRLSTS1_CMP1EN_Pos)       /*!< 0x00000001 */
#define CMP_CTRLSTS1_CMP1EN                 CMP_CTRLSTS1_CMP1EN_Msk                 /*!< Comparator 1 enable */
#define CMP_CTRLSTS1_CMP1IS_Pos             (1U)
#define CMP_CTRLSTS1_CMP1IS_Msk             (0x1U << CMP_CTRLSTS1_CMP1IS_Pos)       /*!< 0x00000002 */
#define CMP_CTRLSTS1_CMP1IS                 CMP_CTRLSTS1_CMP1IS_Msk                 /*!< Comparator 1 input shift */
#define CMP_CTRLSTS1_CMP1SSEL_Pos           (2U)
#define CMP_CTRLSTS1_CMP1SSEL_Msk           (0x1U << CMP_CTRLSTS1_CMP1SSEL_Pos)     /*!< 0x00000004 */
#define CMP_CTRLSTS1_CMP1SSEL               CMP_CTRLSTS1_CMP1SSEL_Msk               /*!< Comparator 1 speed selection */

/*!< CMP1INVSEL configuration */
#define CMP_CTRLSTS1_CMP1INVSEL_Pos         (4U)
#define CMP_CTRLSTS1_CMP1INVSEL_Msk         (0x7U << CMP_CTRLSTS1_CMP1INVSEL_Pos)   /*!< 0x00000070 */
#define CMP_CTRLSTS1_CMP1INVSEL             CMP_CTRLSTS1_CMP1INVSEL_Msk             /*!< CMP1INVSEL[2:0] bits (Comparator 1 inverting selection) */
#define CMP_CTRLSTS1_CMP1INVSEL_0           (0x1U << CMP_CTRLSTS1_CMP1INVSEL_Pos)   /*!< 0x00000010 */
#define CMP_CTRLSTS1_CMP1INVSEL_1           (0x2U << CMP_CTRLSTS1_CMP1INVSEL_Pos)   /*!< 0x00000020 */
#define CMP_CTRLSTS1_CMP1INVSEL_2           (0x4U << CMP_CTRLSTS1_CMP1INVSEL_Pos)   /*!< 0x00000040 */

/*!< CMP1TAG configuration */
#define CMP_CTRLSTS1_CMP1TAG_Pos            (8U)
#define CMP_CTRLSTS1_CMP1TAG_Msk            (0x7U << CMP_CTRLSTS1_CMP1TAG_Pos)      /*!< 0x00000700 */
#define CMP_CTRLSTS1_CMP1TAG                CMP_CTRLSTS1_CMP1TAG_Msk                /*!< CMP1TAG[2:0] bits (Comparator 1 output target) */
#define CMP_CTRLSTS1_CMP1TAG_0              (0x1U << CMP_CTRLSTS1_CMP1TAG_Pos)      /*!< 0x00000100 */
#define CMP_CTRLSTS1_CMP1TAG_1              (0x2U << CMP_CTRLSTS1_CMP1TAG_Pos)      /*!< 0x00000200 */
#define CMP_CTRLSTS1_CMP1TAG_2              (0x4U << CMP_CTRLSTS1_CMP1TAG_Pos)      /*!< 0x00000400 */

#define CMP_CTRLSTS1_CMP1P_Pos              (11U)
#define CMP_CTRLSTS1_CMP1P_Msk              (0x1U << CMP_CTRLSTS1_CMP1P_Pos)        /*!< 0x00000800 */
#define CMP_CTRLSTS1_CMP1P                  CMP_CTRLSTS1_CMP1P_Msk                  /*!< Comparator 1 polarity */

/*!< CMP1HYST configuration */
#define CMP_CTRLSTS1_CMP1HYST_Pos           (12U)
#define CMP_CTRLSTS1_CMP1HYST_Msk           (0x3U << CMP_CTRLSTS1_CMP1HYST_Pos)     /*!< 0x00003000 */
#define CMP_CTRLSTS1_CMP1HYST               CMP_CTRLSTS1_CMP1HYST_Msk               /*!< CMP1HYST[1:0] bits (Comparator 1 hysteresis) */
#define CMP_CTRLSTS1_CMP1HYST_0             (0x1U << CMP_CTRLSTS1_CMP1HYST_Pos)     /*!< 0x00001000 */
#define CMP_CTRLSTS1_CMP1HYST_1             (0x2U << CMP_CTRLSTS1_CMP1HYST_Pos)     /*!< 0x00002000 */

#define CMP_CTRLSTS1_CMP1VALUE_Pos          (14U)
#define CMP_CTRLSTS1_CMP1VALUE_Msk          (0x1U << CMP_CTRLSTS1_CMP1VALUE_Pos)    /*!< 0x00004000 */
#define CMP_CTRLSTS1_CMP1VALUE              CMP_CTRLSTS1_CMP1VALUE_Msk              /*!< Comparator 1 output value */
#define CMP_CTRLSTS1_CMP1WP_Pos             (15U)
#define CMP_CTRLSTS1_CMP1WP_Msk             (0x1U << CMP_CTRLSTS1_CMP1WP_Pos)       /*!< 0x00008000 */
#define CMP_CTRLSTS1_CMP1WP                 CMP_CTRLSTS1_CMP1WP_Msk                 /*!< Comparator 1 write protect */
#define CMP_CTRLSTS1_CMP2EN_Pos             (16U)
#define CMP_CTRLSTS1_CMP2EN_Msk             (0x1U << CMP_CTRLSTS1_CMP2EN_Pos)       /*!< 0x00010000 */
#define CMP_CTRLSTS1_CMP2EN                 CMP_CTRLSTS1_CMP2EN_Msk                 /*!< Comparator 2 enable */
#define CMP_CTRLSTS1_CMP2SSEL_Pos           (18U)
#define CMP_CTRLSTS1_CMP2SSEL_Msk           (0x1U << CMP_CTRLSTS1_CMP2SSEL_Pos)     /*!< 0x00040000 */
#define CMP_CTRLSTS1_CMP2SSEL               CMP_CTRLSTS1_CMP2SSEL_Msk               /*!< Comparator 2 speed selection */

/*!< CMP2INVSEL configuration */
#define CMP_CTRLSTS1_CMP2INVSEL_Pos         (20U)
#define CMP_CTRLSTS1_CMP2INVSEL_Msk         (0x7U << CMP_CTRLSTS1_CMP2INVSEL_Pos)   /*!< 0x00700000 */
#define CMP_CTRLSTS1_CMP2INVSEL             CMP_CTRLSTS1_CMP2INVSEL_Msk             /*!< CMP2INVSEL[2:0] bits (Comparator 2 inverting selection) */
#define CMP_CTRLSTS1_CMP2INVSEL_0           (0x1U << CMP_CTRLSTS1_CMP2INVSEL_Pos)   /*!< 0x00100000 */
#define CMP_CTRLSTS1_CMP2INVSEL_1           (0x2U << CMP_CTRLSTS1_CMP2INVSEL_Pos)   /*!< 0x00200000 */
#define CMP_CTRLSTS1_CMP2INVSEL_2           (0x4U << CMP_CTRLSTS1_CMP2INVSEL_Pos)   /*!< 0x00400000 */

#define CMP_CTRLSTS1_DCMPEN_Pos             (23U)
#define CMP_CTRLSTS1_DCMPEN_Msk             (0x1U << CMP_CTRLSTS1_DCMPEN_Pos)       /*!< 0x00800000 */
#define CMP_CTRLSTS1_DCMPEN                 CMP_CTRLSTS1_DCMPEN_Msk                 /*!< Double comparator mode enable */

/*!< CMP2TAG configuration */
#define CMP_CTRLSTS1_CMP2TAG_Pos            (24U)
#define CMP_CTRLSTS1_CMP2TAG_Msk            (0x7U << CMP_CTRLSTS1_CMP2TAG_Pos)      /*!< 0x07000000 */
#define CMP_CTRLSTS1_CMP2TAG                CMP_CTRLSTS1_CMP2TAG_Msk                /*!< CMP2TAG[2:0] bits (Comparator 2 output target) */
#define CMP_CTRLSTS1_CMP2TAG_0              (0x1U << CMP_CTRLSTS1_CMP2TAG_Pos)      /*!< 0x01000000 */
#define CMP_CTRLSTS1_CMP2TAG_1              (0x2U << CMP_CTRLSTS1_CMP2TAG_Pos)      /*!< 0x02000000 */
#define CMP_CTRLSTS1_CMP2TAG_2              (0x4U << CMP_CTRLSTS1_CMP2TAG_Pos)      /*!< 0x04000000 */

#define CMP_CTRLSTS1_CMP2P_Pos              (27U)
#define CMP_CTRLSTS1_CMP2P_Msk              (0x1U << CMP_CTRLSTS1_CMP2P_Pos)        /*!< 0x08000000 */
#define CMP_CTRLSTS1_CMP2P                  CMP_CTRLSTS1_CMP2P_Msk                  /*!< Comparator 2 polarity */

/*!< CMP2HYST configuration */
#define CMP_CTRLSTS1_CMP2HYST_Pos           (28U)
#define CMP_CTRLSTS1_CMP2HYST_Msk           (0x3U << CMP_CTRLSTS1_CMP2HYST_Pos)     /*!< 0x30000000 */
#define CMP_CTRLSTS1_CMP2HYST               CMP_CTRLSTS1_CMP2HYST_Msk               /*!< CMP2HYST[1:0] bits (Comparator 2 hysteresis) */
#define CMP_CTRLSTS1_CMP2HYST_0             (0x1U << CMP_CTRLSTS1_CMP2HYST_Pos)     /*!< 0x10000000 */
#define CMP_CTRLSTS1_CMP2HYST_1             (0x2U << CMP_CTRLSTS1_CMP2HYST_Pos)     /*!< 0x20000000 */

#define CMP_CTRLSTS1_CMP2VALUE_Pos          (30U)
#define CMP_CTRLSTS1_CMP2VALUE_Msk          (0x1U << CMP_CTRLSTS1_CMP2VALUE_Pos)    /*!< 0x40000000 */
#define CMP_CTRLSTS1_CMP2VALUE              CMP_CTRLSTS1_CMP2VALUE_Msk              /*!< Comparator 2 output value */
#define CMP_CTRLSTS1_CMP2WP_Pos             (31U)
#define CMP_CTRLSTS1_CMP2WP_Msk             (0x1U << CMP_CTRLSTS1_CMP2WP_Pos)       /*!< 0x80000000 */
#define CMP_CTRLSTS1_CMP2WP                 CMP_CTRLSTS1_CMP2WP_Msk                 /*!< Comparator 2 write protect */

